{
  "source_file": "/Users/romualdbuisson/Documents/test/rop.pdf",
  "export_date": "2025-07-11T16:36:55Z",
  "preamble": [
    "1. The Court shall conduct proceedings in accordance with the Agreement, the Statute and these Rules.",
    "In the event of a conflict between the provisions of the Agreement and/or the Statute on the one hand",
    "and of the Rules on the other hand, the provisions of the Agreement and/or the Statute shall prevail.",
    "2. The Rules shall be applied and interpreted in accordance with Articles 41(3), 42 and 52(1) of the",
    "Agreement on the basis of the principles of proportionality, flexibility, fairness and equity.",
    "3. Proportionality shall be ensured by giving due consideration to the nature and complexity of each",
    "action and its importance.",
    "4. Flexibility shall be ensured by applying all procedural rules in a flexible and balanced manner with",
    "the required level of discretion for the judges to organise the proceedings in the most efficient and cost",
    "effective manner.",
    "5. Fairness and equity shall be ensured by having regard to the legitimate interests of all parties.",
    "6. In accordance with these principles, the Court shall apply and interpret the Rules in a way which shall",
    "ensure decisions of the highest quality.",
    "7. In accordance with these principles, proceedings shall be conducted in a way which will normally",
    "allow the final oral hearing on the issues of infringement and validity at first instance to take place within",
    "one year whilst recognising that complex actions may require more time and procedural steps and simple",
    "actions less time and fewer procedural steps. Decisions on costs and/or damages may take place at the",
    "same time or as soon as practicable thereafter. Case management shall be organised in accordance with",
    "these objectives. Parties shall cooperate with the Court and set out their full case as early as possible in",
    "the proceedings.",
    "8. The Court shall endeavour to ensure consistent application and interpretation of these Rules by all",
    "first instance divisions and the Court of Appeal. Due consideration shall also be given to this objective",
    "in any decision concerning leave to appeal against procedural orders.",
    "- 18 -"
  ],
  "application_and_interpretation": [
    "Rule 1 – Application of the Rules and general principles of interpretation",
    "1. The Court shall conduct proceedings in accordance with the Agreement, the Statute and these Rules,",
    "which include the Preamble to these Rules and the principles set out therein. In the event of a conflict",
    "between the provisions of the Agreement and/or the Statute on the one hand and of the Rules on the",
    "other hand, the provisions of the Agreement and/or the Statute shall prevail.",
    "2. Where these Rules provide for the Court to perform any act other than an act exclusively reserved for",
    "a panel of the Court, the President of the Court of First Instance or the President of the Court of Appeal,",
    "that act may be performed by:",
    "(a) the presiding judge or the judge-rapporteur of the panel to which the action has been assigned;",
    "(b) a single legally qualified judge where the action has been assigned to a single judge;",
    "(c) the standing judge designated pursuant to Rule 345.5.",
    "3. References to persons in these Rules may apply to legal persons as well as natural persons. Words",
    "importing the masculine gender shall include the feminine and vice versa. Unless the contrary intention",
    "appears, words in the singular include the plural and vice versa.",
    "Relation with Agreement: Article 8(7)",
    "Relation with Statute: Article 19(3) and (4)",
    "Rule 2 – Supplementary protection certificate",
    "1. Subject to paragraph 2, in these Rules with the exception of Rule 5 the expression “patent” and",
    "“proprietor” shall whenever appropriate include, respectively, a supplementary protection certificate as",
    "defined in Article 2(h) of the Agreement and granted in respect of the patent and the holder of such",
    "certificate.",
    "2. References in these Rules to the language in which the patent was granted shall mean that language",
    "and not the language in which a supplementary protection certificate in respect of the patent was granted.",
    "Rule 3 – Power of staff of the Registry and a sub-registry to perform functions of the Registry",
    "Where these Rules refer to the Registry or Registrar and provide to perform any act that reference shall",
    "include – where applicable – the Deputy-Registrar and the relevant sub-registry and that act may be",
    "performed by the Registrar, the Deputy-Registrar or by a member of staff of the Registry or sub-registry",
    "of the relevant division.",
    "Rule 4 – Lodging of documents",
    "1. Written pleadings and other documents shall be signed and lodged at the Registry or relevant sub-",
    "registry in electronic form. Parties shall make use of the official forms available online. The receipt of",
    "documents shall be confirmed by the automatic issue of an electronic receipt, which shall indicate the",
    "date and local time of receipt.",
    "2. Where it is not possible to lodge a document electronically for the reason that the electronic case",
    "management system of the Court has ceased to function a party may lodge a document in hard-copy",
    "- 19 -",
    "form at the Registry or a sub-registry. An electronic copy of the document shall be lodged as soon as",
    "practicable thereafter.",
    "Relation with Agreement: Article 44",
    "Rule 5 – Lodging of an Application to opt out and withdrawal of an opt-out",
    "1. The proprietor of a European patent (including a European patent that has expired) or the applicant",
    "for a published application for a European patent (hereinafter in this Rule 5 an “application”) who wishes",
    "to opt out that patent or application from the exclusive competence of the Court in accordance with",
    "Article 83(3) of the Agreement shall lodge an Application (hereinafter in this Rule 5 an “Application to",
    "opt out”) with the Registry.",
    "(a) Where the patent or application is owned by two or more proprietors or applicants, all proprietors or",
    "applicants shall lodge the Application to opt out. Where the person lodging an Application to opt out is",
    "not recorded as the proprietor or applicant in the registers referred to in Rule 8.5(a) and (b), respectively,",
    "the person shall lodge a declaration pursuant to paragraph 3(e).",
    "(b) The Application to opt out shall be made in respect of all of the states for which the European patent",
    "has been granted or which have been designated in the application.",
    "2. An Application to opt out or an Application to withdraw an opt-out pursuant to paragraph 7",
    "(hereinafter in this Rule 5 an “Application to withdraw”) shall extend to any supplementary protection",
    "certificate based on the European patent.",
    "(a) Where any such supplementary protection certificate has been granted at the date of lodging the",
    "Application to opt out or the Application to withdraw, the holder of the supplementary protection",
    "certificate shall, if different from the proprietor of the patent, lodge the Application to opt out or the",
    "Application to withdraw together with the proprietor.",
    "(b) Where any such supplementary protection certificate is granted subsequent to lodging the",
    "Application to opt out, the opt-out shall take effect automatically on grant of said supplementary",
    "protection certificate.",
    "(c) Paragraphs 6 and 8 shall apply mutatis mutandis. For the purposes of paragraphs 6 and 8, reference",
    "to actions",
    "(i) in respect of a European patent shall apply to all supplementary protection certificates based on",
    "that European patent, and",
    "(ii) in respect of a supplementary protection certificate shall apply to the European patent on which",
    "such supplementary protection certificate is based and",
    "(iii) in respect of a supplementary protection certificate shall apply to all other supplementary",
    "protection certificates based on the same European patent.",
    "(d) For the avoidance of doubt, it is not possible to opt out supplementary protection certificates, whether",
    "granted by the authorities of a Contracting Member State or otherwise, based on a European patent with",
    "unitary effect.",
    "3. The Application to opt out shall contain:",
    "(a) the name of each proprietor or applicant for the European patent or application and of the holder of",
    "- 20 -",
    "any supplementary protection certificate based on the European patent in question, and all relevant",
    "postal and, where applicable, electronic addresses;",
    "(b) the name and postal address and electronic address of",
    "(i) the representative appointed by the applicant or the proprietor in accordance with Article 48",
    "of the Agreement or",
    "(ii) any other person lodging the Application to opt out on behalf of the proprietor or the",
    "applicant and the mandate for lodging the Application to opt out;",
    "(c) details of the patent and/or application including the EP publication number;",
    "(d) details of any supplementary protection certificate granted based on the patent concerned, including",
    "the number; and",
    "(e) for the purposes of paragraph 1(a), a declaration by or on behalf of each proprietor or applicant",
    "pursuant to Rule 8.5 that he is entitled to be registered in the national patent register.",
    "4. Rule 8 shall not apply to Applications to opt out and to Applications to withdraw made pursuant to",
    "this Rule 5.",
    "5. The Registrar shall as soon as practicable enter the Application to opt out in the register. Subject to",
    "paragraph 6, the opt-out which meets the requirements laid down in this Rule shall be regarded as",
    "effective from the date of entry in the register. If the requirements recorded in the register are missing",
    "or incorrect, a correction may be lodged with the Registry. The date of entry of the correction shall be",
    "noted in the register. The opt-out shall be effective from the date of correction.",
    "6. In the event that an action has been commenced before the Court in respect of a patent and/or an",
    "application contained in an Application to opt out prior to the date of entry of the Application to opt out",
    "in the register or prior to the date of correction pursuant to paragraph 5, the Application to opt out shall",
    "be ineffective in respect of the patent and/or application in question, irrespective of whether the action",
    "is pending or has been concluded.",
    "7. A proprietor of a patent or an application the subject of an opt-out pursuant to this Rule may lodge an",
    "Application to withdraw in respect of the patent or application, but not in respect of different states for",
    "which the European patent has been granted or which have been designated in the application. The",
    "Application to withdraw shall contain the particulars in accordance with paragraph 3. The Registrar shall",
    "as soon as practicable enter the Application to withdraw in the register and the withdrawal shall be",
    "regarded as effective from the date of entry in the register. Paragraphs 1(a) and 5 shall apply mutatis",
    "mutandis.",
    "8. In the event that an action has been commenced before a court of a Contracting Member State in a",
    "matter over which the Court also has jurisdiction pursuant to Article 32 of the Agreement in respect of",
    "a patent or application contained in an Application to withdraw, prior to the entry of the Application to",
    "withdraw in the register or any time before the date pursuant to paragraph 5, the Application to withdraw",
    "shall be ineffective in respect of the patent or application in question, irrespective of whether the action",
    "is pending or has been concluded.",
    "9. Where an application for a European patent subject to an opt-out pursuant to this Rule proceeds to",
    "grant as a European patent with unitary effect the opt-out shall be deemed to have been withdrawn and",
    "the Registrar shall as soon as practicable enter the withdrawal in the register.",
    "- 21 -",
    "10. A patent or application the subject of an Application to withdraw which has been entered on the",
    "register may not thereafter be the subject of a further Application to opt out.",
    "11. The Registrar shall as soon as practicable notify the European Patent Office and the national patent",
    "office of any Contracting Member States concerned of the entries in the register pursuant to paragraphs 5",
    "and 7.",
    "12. Applications accepted by the Registry before the entry into force of the Agreement shall be treated",
    "as entered on the register on the date of entry into force of the Agreement.",
    "Relation with Agreement: Article 83(3) and (4)",
    "Rule 5A – Application to remove an unauthorised application to opt out or unauthorised",
    "withdrawal of an opt-out",
    "1. Without prejudice to the lodging of an Application to opt out or withdraw an opt-out in accordance",
    "with Rule 5, the proprietor of a European patent or the applicant for a published application for a",
    "European patent or holder of a supplementary protection certificate in relation to which an Application",
    "to opt out or withdraw the opt-out is entered in the register may lodge an Application to remove the",
    "entry of an unauthorised Application to opt out or withdrawal of the opt-out from the Registry setting",
    "out the reasons.",
    "2. The Registrar shall mark the status of the Application to opt out or withdraw the opt-out entered in",
    "the register as subject to an Application for removal. The Registrar shall decide on the Application for",
    "removal as soon as practicable. If the final decision is to remove the Application to opt out or withdrawal",
    "of an opt-out the Registrar shall delete it in the register.",
    "3. The decision on the Application for removal may be subject to an Application for review to the",
    "President of the Court of Appeal. The Application for review shall be lodged with the Registrar in one",
    "of the official languages of the European Patent Office, within one month of the notification of the",
    "challenged decision setting out the request, facts, evidence and arguments. If the Application for review",
    "is allowable, the President of the Court of Appeal shall order the Registrar to remove the opt-out or the",
    "withdrawal of the opt-out.",
    "Rule 6 – Service and supply of orders, decisions, written pleadings and other documents",
    "1. The Registry shall as soon as practicable serve, in accordance with Part 5, Chapter 2:",
    "(a) orders and decisions of the Court on the parties;",
    "(b) written pleadings and other documents of a party on the other party.",
    "Where applicable, the Registry shall inform the parties of the opportunity to reply or to take any other",
    "appropriate step in the proceedings and of any time period for so doing.",
    "2. The Registry shall also as soon as practicable supply to the parties copies of documents referred to in",
    "these Rules and lodged with pleadings and written evidence.",
    "3. Where the postal or electronic address for service provided by a party pursuant to these Rules has",
    "changed that party shall give notice to the Registry and to every other party as soon as such change has",
    "taken place.",
    "- 22 -",
    "Rule 7 – Language of written pleadings and written evidence",
    "1. Written pleadings and other documents, including written evidence, shall be lodged in the language",
    "of the proceedings unless the Court or these Rules otherwise provide.",
    "2. Where these Rules or the Court require a pleading or other document to be translated it shall not be",
    "necessary to provide a formal certification by the translator as to the accuracy of such translation unless",
    "the accuracy is challenged by a party or such certification is ordered by the Court or required by these",
    "Rules.",
    "Rule 8 – Party and party’s representative",
    "1. A party shall be represented in accordance with Article 48 of the Agreement unless otherwise",
    "provided by these Rules [Rules 5, 88.4 and 378.5].",
    "2. For the purpose of all proceedings in relation to a patent, where these Rules provide that a party",
    "performs any act or that any act be performed upon a party that act shall be performed by or upon the",
    "representative for the time being of the party.",
    "3. Except where these Rules provide otherwise, a party shall not communicate with the Court without",
    "informing the other party. Where such communication is in writing, the communication should be copied",
    "to the other party unless these Rules provide that the Court will supply a copy to the other party.",
    "4. For the purposes of proceedings under these Rules in relation to the proprietor of a European patent",
    "with unitary effect, the person shown in the Register for unitary patent protection [Regulation (EU)",
    "No 1257/2012, Article 2(e)] as the proprietor shall be treated as such. If during proceedings before the",
    "Court a new proprietor is recorded in the Register for unitary patent protection, the former registered",
    "proprietor may apply to the Court pursuant to Rule 305.1(c) for the substitution of the new proprietor.",
    "5. Subject to paragraph 6, for the purposes of proceedings under these Rules:",
    "(a) in relation to the proprietor of a European patent, the person entitled to be registered as proprietor",
    "under the law of each Contracting Member State in which such European patent has been validated shall",
    "be treated as the proprietor whether or not such person is in fact recorded in the register of patents",
    "maintained in such Contracting Member State (hereinafter “national patent register”); and",
    "(b) in relation to the applicant for a European patent, the person entitled to be registered as applicant",
    "whether or not such person is in fact recorded as such in the European Patent Register kept by the",
    "European Patent Office.",
    "(c) For the purposes of paragraph 5, there shall be a rebuttable presumption that the person shown in",
    "each national patent register and the European Patent Register kept by the European Patent Office is the",
    "person entitled to be registered as proprietor or applicant as the case may be.",
    "6. For the purposes of proceedings pursuant to Rules 42 and 61 in relation to a European patent, the",
    "person shown in the national patent register [Rule 8.5(a)] as the proprietor shall be treated as such for",
    "each Contracting Member State or, as far as no such person is registered in a national patent register,",
    "the last person shown recorded as proprietor in the European Patent Register kept by the European Patent",
    "Office.",
    "Relation with Agreement: Article 48",
    "- 23 -",
    "Rule 9 – Powers of the Court",
    "1. The Court may, at any stage of the proceedings, of its own motion or on a reasoned request by a party,",
    "make a procedural order such as to order a party to take any step, answer any question or provide any",
    "clarification or evidence, within time periods to be specified.",
    "2. The Court may disregard any step, fact, evidence or argument which a party has not taken or submitted",
    "in accordance with a time limit set by the Court or these Rules.",
    "3. Subject to paragraph 4, on a reasoned request by a party, the Court may:",
    "(a) extend, even retrospectively, a time period referred to in these Rules or imposed by the Court; and",
    "(b) shorten any such time period.",
    "4. The Court shall not extend the time periods referred to in Rules 198.1, 213.1 and 224.1.",
    "- 24 -"
  ],
  "content": [
    {
      "part_number": "1",
      "part_title": "PROCEDURES BEFORE THE COURT OF FIRST INSTANCE .................... 25",
      "chapters": [
        {
          "chapter_number": "1",
          "chapter_title": "WRITTEN PROCEDURE .......................................................................... 26",
          "sections": [
            {
              "section_number": "1",
              "section_title": "INFRINGEMENT ACTION ...................................................................... 26",
              "rules": [
                {
                  "rule_number": "12",
                  "rule_title": "Exchange of written pleadings (infringement action) .................................... 26",
                  "paragraphs": [
                    "STATEMENT OF CLAIM ...................................................................................................... 26"
                  ]
                },
                {
                  "rule_number": "13",
                  "rule_title": "Contents of the Statement of claim ................................................................ 26",
                  "paragraphs": []
                },
                {
                  "rule_number": "14",
                  "rule_title": "Use of languages under Article 49(1) and (2) of the Agreement ................... 28",
                  "paragraphs": []
                },
                {
                  "rule_number": "15",
                  "rule_title": "Fee for the infringement action ...................................................................... 28",
                  "paragraphs": []
                },
                {
                  "rule_number": "16",
                  "rule_title": "Examination as to formal requirements of the Statement of claim ................ 29",
                  "paragraphs": []
                },
                {
                  "rule_number": "17",
                  "rule_title": "Recording in the register and assignment (Court of First Instance, infringement",
                  "paragraphs": [
                    "action) ............................................................................................................................. 29"
                  ]
                },
                {
                  "rule_number": "18",
                  "rule_title": "Designation of the judge-rapporteur .............................................................. 30",
                  "paragraphs": [
                    "- 3 -",
                    "PROCEDURE WHEN THE DEFENDANT RAISES A PRELIMINARY OBJECTION ................. 30"
                  ]
                },
                {
                  "rule_number": "19",
                  "rule_title": "Preliminary objection ..................................................................................... 30",
                  "paragraphs": []
                },
                {
                  "rule_number": "20",
                  "rule_title": "Decision or order on a Preliminary objection ................................................ 31",
                  "paragraphs": []
                },
                {
                  "rule_number": "21",
                  "rule_title": "Appeal against decision or order on a Preliminary objection ........................ 31",
                  "paragraphs": [
                    "VALUE-BASED FEE FOR THE INFRINGEMENT ACTION .................................................... 31"
                  ]
                },
                {
                  "rule_number": "22",
                  "rule_title": "Determination of value-based fee for the infringement action ...................... 31",
                  "paragraphs": [
                    "STATEMENT OF DEFENCE .................................................................................................. 32"
                  ]
                },
                {
                  "rule_number": "23",
                  "rule_title": "Lodging of the Statement of defence ............................................................. 32",
                  "paragraphs": []
                },
                {
                  "rule_number": "24",
                  "rule_title": "Contents of the Statement of defence............................................................. 32",
                  "paragraphs": []
                },
                {
                  "rule_number": "25",
                  "rule_title": "Counterclaim for revocation .......................................................................... 32",
                  "paragraphs": []
                },
                {
                  "rule_number": "26",
                  "rule_title": "Fee for the Counterclaim for revocation ........................................................ 33",
                  "paragraphs": []
                },
                {
                  "rule_number": "27",
                  "rule_title": "Examination as to formal requirements of the Statement of defence and",
                  "paragraphs": [
                    "Counterclaim for revocation ........................................................................................... 33"
                  ]
                },
                {
                  "rule_number": "28",
                  "rule_title": "Further schedule ............................................................................................. 34",
                  "paragraphs": [
                    "DEFENCE TO THE COUNTERCLAIM FOR REVOCATION, REPLY TO THE STATEMENT OF",
                    "THE DEFENCE AND APPLICATION TO AMEND THE PATENT AND REJOINDER TO THE",
                    "REPLY .................................................................................................................................. 34"
                  ]
                },
                {
                  "rule_number": "29",
                  "rule_title": "Lodging of Defence to the Counterclaim for revocation, Reply to the Statement",
                  "paragraphs": [
                    "of defence and Rejoinder to the Reply ........................................................................... 34"
                  ]
                },
                {
                  "rule_number": "29A",
                  "rule_title": "Contents of the Defence to the Counterclaim ............................................. 34",
                  "paragraphs": []
                },
                {
                  "rule_number": "30",
                  "rule_title": "Application to amend the patent .................................................................... 35",
                  "paragraphs": [
                    "DEFENCE TO THE APPLICATION TO AMEND THE PATENT .............................................. 35"
                  ]
                },
                {
                  "rule_number": "32",
                  "rule_title": "Lodging of the Defence to the Application to amend the patent, the Reply to",
                  "paragraphs": [
                    "the Defence and the Rejoinder to the Reply ................................................................... 35",
                    "APPLICATION FOR ALLOCATING A TECHNICALLY QUALIFIED JUDGE TO THE PANEL 36"
                  ]
                },
                {
                  "rule_number": "33",
                  "rule_title": "Application by a party for allocating a technically qualified judge ............... 36",
                  "paragraphs": []
                },
                {
                  "rule_number": "34",
                  "rule_title": "Request by the judge-rapporteur for allocating a technically qualified judge 36",
                  "paragraphs": [
                    "LAST STEPS IN THE WRITTEN PROCEDURE ...................................................................... 36"
                  ]
                },
                {
                  "rule_number": "35",
                  "rule_title": "Closure of the written procedure .................................................................... 36",
                  "paragraphs": []
                },
                {
                  "rule_number": "36",
                  "rule_title": "Further exchanges of written pleadings ......................................................... 36",
                  "paragraphs": []
                },
                {
                  "rule_number": "37",
                  "rule_title": "Application of Article 33(3) of the Agreement .............................................. 36",
                  "paragraphs": [
                    "COUNTERCLAIM FOR REVOCATION REFERRED TO THE CENTRAL DIVISION UNDER",
                    "ARTICLE 33(3)(B) OF THE AGREEMENT ............................................................................ 37"
                  ]
                },
                {
                  "rule_number": "38",
                  "rule_title": "Written procedure when the central division deals with a Counterclaim for",
                  "paragraphs": [
                    "- 4 -",
                    "revocation under Article 33(3)(b) of the Agreement ...................................................... 37"
                  ]
                },
                {
                  "rule_number": "39",
                  "rule_title": "Language of the proceedings before the central division ............................... 37",
                  "paragraphs": []
                },
                {
                  "rule_number": "40",
                  "rule_title": "Accelerated proceedings before the central division ..................................... 38",
                  "paragraphs": [
                    "ACTION REFERRED TO THE CENTRAL DIVISION UNDER ARTICLE 33(3)(C) OF THE",
                    "AGREEMENT ....................................................................................................................... 38"
                  ]
                },
                {
                  "rule_number": "41",
                  "rule_title": "Written procedure when the central division deals with the action under",
                  "paragraphs": [
                    "Article 33(3)(c) of the Agreement .................................................................................. 38"
                  ]
                }
              ]
            },
            {
              "section_number": "2",
              "section_title": "REVOCATION ACTION .......................................................................... 38",
              "rules": [
                {
                  "rule_number": "42",
                  "rule_title": "Action to be directed against the patent proprietor ........................................ 38",
                  "paragraphs": []
                },
                {
                  "rule_number": "43",
                  "rule_title": "Exchange of written pleadings (revocation action) ........................................ 39",
                  "paragraphs": [
                    "STATEMENT FOR REVOCATION ......................................................................................... 39"
                  ]
                },
                {
                  "rule_number": "44",
                  "rule_title": "Contents of the Statement for revocation ....................................................... 39",
                  "paragraphs": []
                },
                {
                  "rule_number": "45",
                  "rule_title": "Language of the Statement for revocation ..................................................... 40",
                  "paragraphs": []
                },
                {
                  "rule_number": "46",
                  "rule_title": "Fee for the revocation action .......................................................................... 40",
                  "paragraphs": []
                },
                {
                  "rule_number": "47",
                  "rule_title": "Examination as to formal requirements, recording in the register, assignment",
                  "paragraphs": [
                    "(Court of First Instance, revocation action) and designation of the judge-rapporteur .... 40"
                  ]
                },
                {
                  "rule_number": "48",
                  "rule_title": "Preliminary objection ..................................................................................... 40",
                  "paragraphs": [
                    "DEFENCE TO REVOCATION ................................................................................................ 40"
                  ]
                },
                {
                  "rule_number": "49",
                  "rule_title": "Lodging of the Defence to revocation ............................................................ 40",
                  "paragraphs": []
                },
                {
                  "rule_number": "50",
                  "rule_title": "Contents of the Defence to revocation and Counterclaim for infringement .. 41",
                  "paragraphs": []
                },
                {
                  "rule_number": "51",
                  "rule_title": "Reply to Defence to revocation ...................................................................... 41",
                  "paragraphs": []
                },
                {
                  "rule_number": "52",
                  "rule_title": "Rejoinder to the Reply ................................................................................... 41",
                  "paragraphs": []
                },
                {
                  "rule_number": "53",
                  "rule_title": "Fee for the Counterclaim for infringement .................................................... 41",
                  "paragraphs": []
                },
                {
                  "rule_number": "54",
                  "rule_title": "Examination as to formal requirements and further schedule ........................ 41",
                  "paragraphs": [
                    "DEFENCE TO THE APPLICATION TO AMEND THE PATENT AND DEFENCE TO THE",
                    "COUNTERCLAIM FOR INFRINGEMENT .............................................................................. 41"
                  ]
                },
                {
                  "rule_number": "55",
                  "rule_title": "Lodging of the Defence to the Application to amend the patent, the Reply to",
                  "paragraphs": [
                    "the Defence and the Rejoinder to the Reply ................................................................... 41"
                  ]
                },
                {
                  "rule_number": "56",
                  "rule_title": "Lodging of the Defence to the Counterclaim for infringement ...................... 41",
                  "paragraphs": []
                },
                {
                  "rule_number": "57",
                  "rule_title": "Request for allocating a technically qualified judge ...................................... 42",
                  "paragraphs": []
                },
                {
                  "rule_number": "58",
                  "rule_title": "Closure of the written procedure subject to the possible exchange of further",
                  "paragraphs": [
                    "pleadings ......................................................................................................................... 42"
                  ]
                },
                {
                  "rule_number": "60",
                  "rule_title": "Determination of the value-based fee for the Counterclaim for infringement 42",
                  "paragraphs": [
                    "- 5 -"
                  ]
                }
              ]
            },
            {
              "section_number": "3",
              "section_title": "ACTION FOR DECLARATION OF NON-INFRINGEMENT ............. 42",
              "rules": [
                {
                  "rule_number": "61",
                  "rule_title": "Declaration of non-infringement .................................................................... 42",
                  "paragraphs": []
                },
                {
                  "rule_number": "62",
                  "rule_title": "Exchange of written pleadings (action for declaration of non-infringement) 43",
                  "paragraphs": []
                },
                {
                  "rule_number": "63",
                  "rule_title": "Contents of the Statement for a declaration of non-infringement .................. 43",
                  "paragraphs": []
                },
                {
                  "rule_number": "64",
                  "rule_title": "Language of the Statement for a declaration of non-infringement ................ 44",
                  "paragraphs": []
                },
                {
                  "rule_number": "65",
                  "rule_title": "Examination as to formal requirements, recording in the register, assignment",
                  "paragraphs": [
                    "and designation of the judge-rapporteur ......................................................................... 44"
                  ]
                },
                {
                  "rule_number": "66",
                  "rule_title": "Preliminary objection ..................................................................................... 44",
                  "paragraphs": []
                },
                {
                  "rule_number": "67",
                  "rule_title": "Lodging of the Defence to the Statement for a declaration of non-infringement",
                  "paragraphs": [
                    "........................................................................................................................................ 44"
                  ]
                },
                {
                  "rule_number": "68",
                  "rule_title": "Contents of the Defence to the Statement for a declaration of non-infringement",
                  "paragraphs": [
                    "........................................................................................................................................ 44"
                  ]
                },
                {
                  "rule_number": "69",
                  "rule_title": "Reply to Defence to the Statement for a declaration of non-infringement and",
                  "paragraphs": [
                    "Rejoinder to the Reply .................................................................................................... 44"
                  ]
                },
                {
                  "rule_number": "70",
                  "rule_title": "Fee for the action for a declaration of non-infringement ............................... 44",
                  "paragraphs": []
                },
                {
                  "rule_number": "71",
                  "rule_title": "Examination as to formal requirements and further schedule ........................ 44",
                  "paragraphs": []
                },
                {
                  "rule_number": "72",
                  "rule_title": "Request for allocating a technically qualified judge ...................................... 44",
                  "paragraphs": []
                },
                {
                  "rule_number": "73",
                  "rule_title": "Closure of the written procedure subject to the possible exchange of further",
                  "paragraphs": [
                    "pleadings ......................................................................................................................... 44"
                  ]
                },
                {
                  "rule_number": "74",
                  "rule_title": "Value-based fee for the action for a declaration of non-infringement ........... 45",
                  "paragraphs": []
                }
              ]
            },
            {
              "section_number": "4",
              "section_title": "ACTIONS WITHIN ARTICLE 33(5) AND (6) OF THE AGREEMENT",
              "rules": [
                {
                  "rule_number": "75",
                  "rule_title": "Revocation action and subsequent infringement action in a local or regional",
                  "paragraphs": [
                    "division (Article 33(5) of the Agreement) ...................................................................... 45"
                  ]
                },
                {
                  "rule_number": "76",
                  "rule_title": "Actions for declaration of non-infringement within Article 33(6) of the",
                  "paragraphs": [
                    "Agreement ...................................................................................................................... 45"
                  ]
                },
                {
                  "rule_number": "77",
                  "rule_title": "Action for declaration of non-infringement and action for revocation .......... 46",
                  "paragraphs": []
                }
              ]
            },
            {
              "section_number": "5",
              "section_title": "ACTION FOR COMPENSATION FOR LICENCES ON THE BASIS OF",
              "rules": [
                {
                  "rule_number": "80",
                  "rule_title": "Compensation for a licence of right ............................................................... 46",
                  "paragraphs": []
                }
              ]
            },
            {
              "section_number": "6",
              "section_title": "ACTION AGAINST DECISIONS OF THE EUROPEAN PATENT",
              "rules": [
                {
                  "rule_number": "85",
                  "rule_title": "Stages of the proceedings (ex parte proceedings) .......................................... 46",
                  "paragraphs": []
                },
                {
                  "rule_number": "86",
                  "rule_title": "Suspensive effect............................................................................................ 47",
                  "paragraphs": []
                },
                {
                  "rule_number": "87",
                  "rule_title": "Grounds for annulling or altering a decision of the Office ............................ 47",
                  "paragraphs": [
                    "- 6 -"
                  ]
                },
                {
                  "rule_number": "88",
                  "rule_title": "Application to annul or alter a decision of the Office .................................... 47",
                  "paragraphs": []
                },
                {
                  "rule_number": "89",
                  "rule_title": "Examination as to formal requirements (ex parte proceedings) .................... 48",
                  "paragraphs": []
                },
                {
                  "rule_number": "90",
                  "rule_title": "Recording in the register (ex parte proceedings) ........................................... 48",
                  "paragraphs": []
                },
                {
                  "rule_number": "91",
                  "rule_title": "Interlocutory revision by the European Patent Office .................................... 48",
                  "paragraphs": []
                },
                {
                  "rule_number": "92",
                  "rule_title": "Assignment to panel or to single judge, designation of judge-rapporteur...... 49",
                  "paragraphs": []
                },
                {
                  "rule_number": "93",
                  "rule_title": "Examination of the Application to annul or alter a decision of the Office .... 49",
                  "paragraphs": []
                },
                {
                  "rule_number": "94",
                  "rule_title": "Invitation to the President of the European Patent Office to comment .......... 49",
                  "paragraphs": []
                },
                {
                  "rule_number": "95",
                  "rule_title": "Lex specialis for the interim procedure (ex parte procedure) ........................ 49",
                  "paragraphs": []
                },
                {
                  "rule_number": "96",
                  "rule_title": "Lex specialis for the oral procedure (ex parte procedure) .............................. 49",
                  "paragraphs": []
                },
                {
                  "rule_number": "97",
                  "rule_title": "Application to annul a decision of the Office to reject a request for unitary",
                  "paragraphs": [
                    "effect ............................................................................................................................... 49"
                  ]
                },
                {
                  "rule_number": "98",
                  "rule_title": "Costs ............................................................................................................... 50",
                  "paragraphs": []
                }
              ]
            }
          ]
        },
        {
          "chapter_number": "2",
          "chapter_title": "INTERIM PROCEDURE ............................................................................ 51",
          "sections": []
        },
        {
          "chapter_number": "3",
          "chapter_title": "ORAL PROCEDURE .................................................................................. 55",
          "sections": []
        },
        {
          "chapter_number": "4",
          "chapter_title": "PROCEDURE FOR THE DETERMINATION OF DAMAGES AND",
          "sections": [
            {
              "section_number": "1",
              "section_title": "APPLICATION FOR THE DETERMINATION OF DAMAGES ........ 58",
              "rules": [
                {
                  "rule_number": "131",
                  "rule_title": "Contents of the Application for the determination of damages ................... 58",
                  "paragraphs": []
                },
                {
                  "rule_number": "132",
                  "rule_title": "Fee for the Application for the determination of damages........................... 58",
                  "paragraphs": []
                },
                {
                  "rule_number": "133",
                  "rule_title": "Determination of the value-based fee for the determination of damages..... 59",
                  "paragraphs": []
                },
                {
                  "rule_number": "134",
                  "rule_title": "Examination as to formal requirements of the Application for the",
                  "paragraphs": [
                    "determination of damages ............................................................................................... 59"
                  ]
                },
                {
                  "rule_number": "135",
                  "rule_title": "Recording in the register (Application for the determination of damages) and",
                  "paragraphs": [
                    "service ............................................................................................................................. 59"
                  ]
                },
                {
                  "rule_number": "136",
                  "rule_title": "Stay of the Application for a determination of damages .............................. 59",
                  "paragraphs": []
                },
                {
                  "rule_number": "137",
                  "rule_title": "Reply of the unsuccessful party ................................................................... 59",
                  "paragraphs": []
                },
                {
                  "rule_number": "138",
                  "rule_title": "Contents of the Defence to the Application for the determination of damages",
                  "paragraphs": [
                    "........................................................................................................................................ 60"
                  ]
                },
                {
                  "rule_number": "139",
                  "rule_title": "Reply to the Defence to the Application for the determination of damages and",
                  "paragraphs": [
                    "Rejoinder to the Reply .................................................................................................... 60"
                  ]
                },
                {
                  "rule_number": "140",
                  "rule_title": "Further procedure (Application for the determination of damages) ............ 60",
                  "paragraphs": []
                }
              ]
            },
            {
              "section_number": "2",
              "section_title": "REQUEST TO LAY OPEN BOOKS ........................................................ 60",
              "rules": [
                {
                  "rule_number": "141",
                  "rule_title": "Contents of the Request to lay open books .................................................. 60",
                  "paragraphs": []
                },
                {
                  "rule_number": "142",
                  "rule_title": "Defence of the unsuccessful party, Reply to the Defence and Rejoinder to the",
                  "paragraphs": [
                    "Reply .............................................................................................................................. 61"
                  ]
                },
                {
                  "rule_number": "143",
                  "rule_title": "Further procedure ......................................................................................... 61",
                  "paragraphs": []
                },
                {
                  "rule_number": "144",
                  "rule_title": "Decision on the Request to lay open books ................................................. 61",
                  "paragraphs": []
                }
              ]
            }
          ]
        },
        {
          "chapter_number": "5",
          "chapter_title": "PROCEDURE FOR COST DECISION ..................................................... 62",
          "sections": []
        },
        {
          "chapter_number": "6",
          "chapter_title": "SECURITY FOR COSTS ............................................................................ 64",
          "sections": []
        }
      ]
    },
    {
      "part_number": "2",
      "part_title": "EVIDENCE .............................................................................................................. 65",
      "chapters": [
        {
          "chapter_number": "1",
          "chapter_title": "WITNESSES AND EXPERTS OF THE PARTIES.................................. 67",
          "sections": []
        },
        {
          "chapter_number": "2",
          "chapter_title": "COURT EXPERTS ...................................................................................... 70",
          "sections": []
        },
        {
          "chapter_number": "3",
          "chapter_title": "ORDER TO PRODUCE EVIDENCE AND TO COMMUNICATE",
          "sections": []
        },
        {
          "chapter_number": "4",
          "chapter_title": "ORDER TO PRESERVE EVIDENCE (SAISIE) AND ORDER FOR",
          "sections": []
        },
        {
          "chapter_number": "5",
          "chapter_title": "OTHER EVIDENCE ................................................................................... 78",
          "sections": []
        }
      ]
    },
    {
      "part_number": "3",
      "part_title": "PROVISIONAL MEASURES ................................................................................ 80",
      "chapters": []
    },
    {
      "part_number": "4",
      "part_title": "PROCEDURES BEFORE THE COURT OF APPEAL ...................................... 86",
      "chapters": [
        {
          "chapter_number": "1",
          "chapter_title": "WRITTEN PROCEDURE .......................................................................... 88",
          "sections": [
            {
              "section_number": "1",
              "section_title": "STATEMENT OF APPEAL, STATEMENT OF GROUNDS OF",
              "rules": [
                {
                  "rule_number": "224",
                  "rule_title": "Time periods for lodging the Statement of appeal and the Statement of",
                  "paragraphs": [
                    "grounds of appeal ........................................................................................................... 88"
                  ]
                },
                {
                  "rule_number": "225",
                  "rule_title": "Contents of the Statement of appeal............................................................. 88",
                  "paragraphs": []
                },
                {
                  "rule_number": "226",
                  "rule_title": "Contents of the Statement of grounds of appeal .......................................... 88",
                  "paragraphs": []
                },
                {
                  "rule_number": "227",
                  "rule_title": "Language of the Statement of appeal and of the Statement of grounds of",
                  "paragraphs": [
                    "appeal .............................................................................................................................. 88"
                  ]
                },
                {
                  "rule_number": "228",
                  "rule_title": "Fee for the appeal ......................................................................................... 89",
                  "paragraphs": []
                },
                {
                  "rule_number": "229",
                  "rule_title": "Examination as to formal requirements of the Statement of appeal ............ 89",
                  "paragraphs": []
                },
                {
                  "rule_number": "230",
                  "rule_title": "Recording in the register (Court of Appeal) ................................................ 89",
                  "paragraphs": []
                },
                {
                  "rule_number": "231",
                  "rule_title": "Designation of the judge-rapporteur ............................................................ 90",
                  "paragraphs": []
                },
                {
                  "rule_number": "232",
                  "rule_title": "Translation of file ......................................................................................... 90",
                  "paragraphs": []
                },
                {
                  "rule_number": "233",
                  "rule_title": "Preliminary examination of the Statement of grounds of appeal ................. 90",
                  "paragraphs": []
                },
                {
                  "rule_number": "234",
                  "rule_title": "Challenge to the decision to reject an appeal as inadmissible ...................... 90",
                  "paragraphs": []
                }
              ]
            },
            {
              "section_number": "2",
              "section_title": "STATEMENT OF RESPONSE ................................................................. 91",
              "rules": [
                {
                  "rule_number": "235",
                  "rule_title": "Statement of response .................................................................................. 91",
                  "paragraphs": []
                },
                {
                  "rule_number": "236",
                  "rule_title": "Contents of the Statement of response ......................................................... 91",
                  "paragraphs": []
                },
                {
                  "rule_number": "237",
                  "rule_title": "Statement of cross-appeal ............................................................................ 91",
                  "paragraphs": []
                }
              ]
            },
            {
              "section_number": "3",
              "section_title": "REPLY TO A STATEMENT OF CROSS-APPEAL............................... 92",
              "rules": [
                {
                  "rule_number": "238",
                  "rule_title": "Reply to a Statement of cross-appeal and further schedule ......................... 92",
                  "paragraphs": []
                }
              ]
            },
            {
              "section_number": "4",
              "section_title": "REFERRAL TO THE FULL COURT ...................................................... 92",
              "rules": [
                {
                  "rule_number": "238A",
                  "rule_title": "Decision to refer ........................................................................................ 92",
                  "paragraphs": []
                }
              ]
            }
          ]
        },
        {
          "chapter_number": "2",
          "chapter_title": "INTERIM PROCEDURE ............................................................................ 93",
          "sections": []
        },
        {
          "chapter_number": "3",
          "chapter_title": "ORAL PROCEDURE .................................................................................. 94",
          "sections": []
        },
        {
          "chapter_number": "4",
          "chapter_title": "DECISIONS AND EFFECT OF DECISIONS .......................................... 95",
          "sections": []
        },
        {
          "chapter_number": "5",
          "chapter_title": "PROCEDURE FOR APPLICATION FOR REHEARING ..................... 96",
          "sections": []
        }
      ]
    },
    {
      "part_number": "5",
      "part_title": "GENERAL PROVISIONS...................................................................................... 99",
      "chapters": [
        {
          "chapter_number": "1",
          "chapter_title": "GENERAL PROCEDURAL PROVISIONS ............................................. 99",
          "sections": []
        },
        {
          "chapter_number": "2",
          "chapter_title": "SERVICE .................................................................................................... 103",
          "sections": [
            {
              "section_number": "1",
              "section_title": "SERVICE WITHIN THE CONTRACTING MEMBER STATES ...... 103",
              "rules": [
                {
                  "rule_number": "270",
                  "rule_title": "Scope of this Section .................................................................................. 103",
                  "paragraphs": []
                },
                {
                  "rule_number": "271",
                  "rule_title": "Service of the Statement of claim .............................................................. 103",
                  "paragraphs": []
                },
                {
                  "rule_number": "272",
                  "rule_title": "Notice of service and non-service of the Statement of claim ..................... 104",
                  "paragraphs": []
                }
              ]
            },
            {
              "section_number": "2",
              "section_title": "SERVICE OUTSIDE THE CONTRACTING MEMBER STATES .... 105",
              "rules": [
                {
                  "rule_number": "273",
                  "rule_title": "Scope of this Section .................................................................................. 105",
                  "paragraphs": []
                },
                {
                  "rule_number": "274",
                  "rule_title": "Service outside the Contracting Member States ........................................ 105",
                  "paragraphs": [
                    "- 12 -"
                  ]
                }
              ]
            },
            {
              "section_number": "3",
              "section_title": "SERVICE BY AN ALTERNATIVE METHOD .................................... 105",
              "rules": [
                {
                  "rule_number": "275",
                  "rule_title": "Service of the Statement of claim by an alternative method or at an alternative",
                  "paragraphs": [
                    "place .............................................................................................................................. 105"
                  ]
                }
              ]
            },
            {
              "section_number": "4",
              "section_title": "SERVICE OF ORDERS, DECISIONS AND WRITTEN PLEADINGS",
              "rules": [
                {
                  "rule_number": "276",
                  "rule_title": "Service of orders and decisions .................................................................. 106",
                  "paragraphs": []
                },
                {
                  "rule_number": "277",
                  "rule_title": "Decisions by default under Part 5, Chapter 11 ........................................... 106",
                  "paragraphs": []
                },
                {
                  "rule_number": "278",
                  "rule_title": "Service of written pleadings and other documents .................................... 106",
                  "paragraphs": []
                },
                {
                  "rule_number": "279",
                  "rule_title": "Change of electronic address for service ................................................... 107",
                  "paragraphs": []
                }
              ]
            }
          ]
        },
        {
          "chapter_number": "3",
          "chapter_title": "RIGHTS AND OBLIGATIONS OF REPRESENTATIVES ................. 108",
          "sections": []
        },
        {
          "chapter_number": "4",
          "chapter_title": "STAY OF PROCEEDINGS ...................................................................... 111",
          "sections": []
        },
        {
          "chapter_number": "5",
          "chapter_title": "TIME PERIODS ........................................................................................ 113",
          "sections": []
        },
        {
          "chapter_number": "6",
          "chapter_title": "PARTIES TO PROCEEDINGS................................................................ 114",
          "sections": [
            {
              "section_number": "1",
              "section_title": "PLURALITY OF PARTIES .................................................................... 114",
              "rules": [
                {
                  "rule_number": "302",
                  "rule_title": "Plurality of claimants or patents ................................................................. 114",
                  "paragraphs": [
                    "- 13 -"
                  ]
                },
                {
                  "rule_number": "303",
                  "rule_title": "Plurality of defendants ............................................................................... 114",
                  "paragraphs": []
                }
              ]
            },
            {
              "section_number": "2",
              "section_title": "CHANGE IN PARTIES ............................................................................ 114",
              "rules": [
                {
                  "rule_number": "305",
                  "rule_title": "Change in parties ........................................................................................ 114",
                  "paragraphs": []
                },
                {
                  "rule_number": "306",
                  "rule_title": "Consequences for the proceedings ............................................................. 114",
                  "paragraphs": []
                }
              ]
            },
            {
              "section_number": "3",
              "section_title": "DEATH, DEMISE OR INSOLVENCY OF A PARTY ......................... 115",
              "rules": [
                {
                  "rule_number": "310",
                  "rule_title": "Death or demise of a party ......................................................................... 115",
                  "paragraphs": []
                },
                {
                  "rule_number": "311",
                  "rule_title": "Insolvency of a party .................................................................................. 115",
                  "paragraphs": []
                }
              ]
            },
            {
              "section_number": "4",
              "section_title": "TRANSFER OF PATENT ........................................................................ 115",
              "rules": [
                {
                  "rule_number": "312",
                  "rule_title": "Transfer of the patent or patent application during proceedings ................ 115",
                  "paragraphs": []
                }
              ]
            },
            {
              "section_number": "5",
              "section_title": "INTERVENTION...................................................................................... 116",
              "rules": [
                {
                  "rule_number": "313",
                  "rule_title": "Application to intervene ............................................................................. 116",
                  "paragraphs": []
                },
                {
                  "rule_number": "314",
                  "rule_title": "Order on Application to intervene.............................................................. 116",
                  "paragraphs": []
                },
                {
                  "rule_number": "315",
                  "rule_title": "Statement in intervention ........................................................................... 116",
                  "paragraphs": []
                },
                {
                  "rule_number": "316",
                  "rule_title": "Invitation to intervene ................................................................................ 117",
                  "paragraphs": []
                },
                {
                  "rule_number": "316A",
                  "rule_title": "Forced intervention ................................................................................. 117",
                  "paragraphs": []
                },
                {
                  "rule_number": "317",
                  "rule_title": "No appeal against an order on the Application to intervene ...................... 117",
                  "paragraphs": []
                }
              ]
            },
            {
              "section_number": "6",
              "section_title": "RE-ESTABLISHMENT OF RIGHTS .................................................... 117",
              "rules": [
                {
                  "rule_number": "320",
                  "rule_title": "Re-establishment of rights ......................................................................... 117",
                  "paragraphs": []
                }
              ]
            }
          ]
        },
        {
          "chapter_number": "7",
          "chapter_title": "MISCELLANEOUS PROVISIONS ON LANGUAGES ........................ 119",
          "sections": []
        },
        {
          "chapter_number": "8",
          "chapter_title": "CASE MANAGEMENT ............................................................................ 121",
          "sections": []
        },
        {
          "chapter_number": "9",
          "chapter_title": "RULES RELATING TO THE ORGANISATION OF THE COURT .. 124",
          "sections": []
        },
        {
          "chapter_number": "10",
          "chapter_title": "DECISIONS AND ORDERS ................................................................... 127",
          "sections": []
        },
        {
          "chapter_number": "11",
          "chapter_title": "DECISION BY DEFAULT...................................................................... 129",
          "sections": []
        },
        {
          "chapter_number": "12",
          "chapter_title": "ACTIONS BOUND TO FAIL OR MANIFESTLY INADMISSIBLE 131",
          "sections": []
        },
        {
          "chapter_number": "13",
          "chapter_title": "SETTLEMENT ........................................................................................ 132",
          "sections": []
        }
      ]
    },
    {
      "part_number": "6",
      "part_title": "FEES AND LEGAL AID ...................................................................................... 133",
      "chapters": []
    },
    {
      "part_number": "1",
      "part_title": "PROCEDURES BEFORE THE COURT OF FIRST INSTANCE",
      "chapters": [
        {
          "chapter_number": "1",
          "chapter_title": "WRITTEN PROCEDURE",
          "sections": [
            {
              "section_number": "1",
              "section_title": "INFRINGEMENT ACTION",
              "rules": [
                {
                  "rule_number": "12",
                  "rule_title": "Exchange of written pleadings (infringement action)",
                  "paragraphs": [
                    "1. The written procedure shall consist of:",
                    "(a) the lodging of a Statement of claim (by the claimant) [Rule 13];",
                    "(b) the lodging of a Statement of defence (by the defendant) [Rules 23 and 24]; and, optionally",
                    "(c) the lodging of a Reply to the Statement of defence (by the claimant) [Rule 29(b)]; and",
                    "(d) the lodging of a Rejoinder to the Reply (by the defendant) [Rule 29(c)].",
                    "2. The Statement of defence may include a Counterclaim for revocation [Rule 25.1].",
                    "3. If a Counterclaim for revocation is lodged:",
                    "(a) the claimant and any proprietor who becomes a party pursuant to Rule 25.2 (hereinafter in this",
                    "Rule 12 and Rules 29 to 32, “the proprietor”) shall lodge a Defence to the Counterclaim for revocation",
                    "[Rule 29(a)], which may include an Application to amend the patent by the proprietor [Rule 30];",
                    "(b) the defendant may lodge a Reply to the Defence to the Counterclaim [Rule 29(d)]; and",
                    "(c) the claimant and the proprietor may lodge a Rejoinder to the Reply to the Defence to the",
                    "Counterclaim [Rule 29(e)].",
                    "4. If an Application to amend the patent is lodged by the proprietor, the defendant shall lodge a Defence",
                    "to the Application to amend the patent in the Reply to the Defence to the Counterclaim, the proprietor",
                    "may lodge a Reply to the Defence to the Application to amend and the defendant may lodge a Rejoinder",
                    "to such Reply [Rule 32].",
                    "5. The judge-rapporteur may allow the exchange of further written pleadings, within time periods to be",
                    "specified [Rule 36].",
                    "STATEMENT OF CLAIM"
                  ]
                },
                {
                  "rule_number": "13",
                  "rule_title": "Contents of the Statement of claim",
                  "paragraphs": [
                    "1. The claimant shall lodge a Statement of claim with the division chosen by him [Article 33 of the",
                    "Agreement] which shall contain:",
                    "(a) the name of the claimant, and, where the claimant is a corporate entity, the location of its registered",
                    "office, and of the claimant’s representative;",
                    "(b) the name of the party against whom the Statement is made (the defendant), and, where the defendant",
                    "is a corporate entity, the location of its registered office;",
                    "(c) postal and electronic addresses for service on the claimant and the names of the persons authorised",
                    "to accept service;",
                    "- 26 -",
                    "(d) postal and, where available, electronic addresses for service on the defendant and the names of the",
                    "persons authorised to accept service, if known;",
                    "(e) where the claimant is not the proprietor or not the only proprietor of the patent concerned, postal and",
                    "where available, electronic addresses for service on the proprietor and the names and addresses of the",
                    "persons authorised to accept service, if known;",
                    "(f) where the claimant is not the proprietor of the patent concerned, or not the only proprietor, evidence",
                    "to show the claimant is entitled to commence proceedings [Article 47(2) and (3) of the Agreement];",
                    "(g) details of the patent concerned, including the number;",
                    "(h) where applicable, information about any prior or pending proceedings relating to the patent",
                    "concerned before the Court including any action for revocation or a declaration of non-infringement",
                    "pending before the central division and the date of any such action, the European Patent Office or any",
                    "other court or authority;",
                    "(i) an indication of the division which shall hear the action [Article 33(1) to (6) of the Agreement] with",
                    "an explanation of why that division has competence; where the parties have agreed in accordance with",
                    "Article 33(7) of the Agreement, the indication of the division which shall hear the action shall be",
                    "accompanied by evidence of the defendant’s agreement;",
                    "(j) where applicable, an indication that the action shall be heard by a single judge [Article 8(7) of the",
                    "Agreement], accompanied by evidence of the defendant’s agreement;",
                    "(k) the nature of the claim, the order or the remedy sought by the claimant;",
                    "(l) an indication of the facts relied on, in particular:",
                    "(i) one or more instances of alleged infringements or threatened infringements specifying the date",
                    "and place of each;",
                    "(ii) the identification of the patent claims alleged to be infringed;",
                    "(m) the evidence relied on [Rule 170.1], where available, and an indication of any further evidence",
                    "which will be offered in support;",
                    "(n) the reasons why the facts relied on constitute an infringement of the patent claims, including",
                    "arguments of law and where appropriate an explanation of the proposed claim interpretation;",
                    "(o) an indication of any order the claimant will seek during the interim procedure [Rule 104(e)];",
                    "(p) where the claimant assesses that the value of the infringement action exceeds EUR500.000, an",
                    "indication of the value; and",
                    "(q) a list of the documents, including any witness statements, referred to in the Statement of",
                    "claim, together with any request that all or part of any such document need not be translated",
                    "and/or any request pursuant to Rule 262.2 or Rule 262A.",
                    "2. The claimant shall at the same time supply a copy of each of the documents referred to in the",
                    "Statement of claim.",
                    "- 27 -",
                    "3. The judge-rapporteur shall decide on any request made pursuant to paragraph 1(q) as soon as",
                    "practicable after his designation pursuant to Rule 18."
                  ]
                },
                {
                  "rule_number": "14",
                  "rule_title": "Use of languages under Article 49(1) and (2) of the Agreement",
                  "paragraphs": [
                    "1. Without prejudice to Articles 49(3) to (6) of the Agreement and subject to paragraph 2 and",
                    "Rules 271.7, 321 to 323, proceedings shall be conducted:",
                    "(a) in the official language or one of the official languages designated as language(s) of proceedings",
                    "pursuant to Article 49(1) of the Agreement; or",
                    "(b) in a language designated as language of proceedings by a Contracting Member State pursuant to",
                    "Article 49(2) of the Agreement.",
                    "2. Where a Contracting Member State hosts a local division or participates in a regional division for",
                    "which several languages have been designated pursuant to Article 49(1) and/or Article 49(2) of the",
                    "Agreement:",
                    "(a) subject to paragraphs 2(b) and (c), the claimant may choose as the language of proceedings any of",
                    "the language(s) designated pursuant to Article 49(1) and/or Article 49(2) of the Agreement;",
                    "(b) in proceedings before a local or regional division in a Contracting Member State against a defendant",
                    "who has his domicile or principal place of business in that Contracting Member State where the action",
                    "could not be brought pursuant to Article 33(1)(a) of the Agreement before any other local or regional",
                    "division, proceedings shall be conducted in the official language of the Contracting Member State",
                    "(paragraph 1(a)). Where a designation by a Contracting Member State having several official regional",
                    "languages so indicates, proceedings shall be conducted in the official language of the region in which",
                    "the defendant has his domicile or principal place of business. Where there are two or more such",
                    "defendants whose domicile or principle place of business has different regional languages, the claimant",
                    "may choose the language from the regional languages in question. Where a designation by a Contracting",
                    "Member State having several official languages so indicates, proceedings shall be conducted in the",
                    "official language of the defendant. Where there are two or more such defendants with different official",
                    "languages, the claimant may choose the language from the official languages in question.",
                    "(c) Where a designation of a language under Article 49(2) of the Agreement for a regional division or",
                    "for one or more local division(s) hosted in a Member State so indicates, the judge-rapporteur may order",
                    "in the interest of the panel to provide that judges may use in the oral proceedings the language according",
                    "to paragraph 1(a) and/or to provide that the Court may make any order and deliver any decision in the",
                    "language according to paragraph 1(a) together with a certified translation for the purpose of Rule 118.8",
                    "into the language according to paragraph 1(b).",
                    "3. The Registrar shall maintain a list of languages communicated by Contracting Member States",
                    "pursuant to Article 49(1) and Article 49(2) of the Agreement as well as designations by Contracting",
                    "Member States made pursuant to paragraph 2(b) and (c). The list shall be made publically available",
                    "online.",
                    "4. The Registrar shall return any pleading lodged in a language other than the language of proceedings."
                  ]
                },
                {
                  "rule_number": "15",
                  "rule_title": "Fee for the infringement action",
                  "paragraphs": [
                    "1. The claimant shall pay the fixed fee and, where applicable, the value based fee for the infringement",
                    "action in accordance with Part 6.",
                    "- 28 -",
                    "2. The Statement of claim shall not be deemed to have been lodged until the fixed fee and, where",
                    "applicable, the value based fee for the infringement action has been paid, unless otherwise provided.",
                    "Relation with Agreement: Articles 36(3), 70 and 71"
                  ]
                },
                {
                  "rule_number": "16",
                  "rule_title": "Examination as to formal requirements of the Statement of claim",
                  "paragraphs": [
                    "1. The Registry shall as soon as practicable check whether the patent concerned is the subject of an opt-",
                    "out pursuant to Article 83(3) of the Agreement and Rule 5. In the event of an opt-out the Registry shall",
                    "as soon as practicable inform the claimant who may withdraw or amend the Statement of claim as",
                    "appropriate.",
                    "2. The Registry shall, as soon as practicable after the lodging of the Statement of claim, examine whether",
                    "the requirements of Rules 13.1 (a) to (j), .2, 14 and 15.1 have been complied with.",
                    "3. If the claimant has not complied with the requirements referred to in paragraph 2, the Registry shall",
                    "as soon as practicable invite the claimant to:",
                    "(a) correct the deficiencies within 14 days of service of such notification; and",
                    "(b) where applicable, pay the fee for the infringement action within said 14 days.",
                    "4. The Registry shall at the same time inform the claimant that if the claimant fails to correct the",
                    "deficiencies or pay the fee within the time stated, a decision by default may be given, in accordance with",
                    "Rule 355.",
                    "5. If the claimant fails to correct the deficiencies or pay the fee, the Registry shall inform a judge of the",
                    "division who may reject the action as inadmissible by a decision by default. The judge may give the",
                    "claimant an opportunity to be heard beforehand."
                  ]
                },
                {
                  "rule_number": "17",
                  "rule_title": "Recording in the register and assignment (Court of First Instance, infringement action)",
                  "paragraphs": [
                    "1. If the requirements referred to in Rule 16.2 or 16.3 have been complied with, the Registry shall as",
                    "soon as practicable:",
                    "(a) record the date of receipt of the Statement of claim and attribute an action number to the file;",
                    "(b) record the file in the register; and",
                    "(c) inform the claimant of the action number of the file and the date of receipt.",
                    "2. The action shall be assigned to a panel of a division according to Rule 345.3. Where requested by the",
                    "parties the action shall be assigned to a single judge in accordance with Rule 345.6.",
                    "3. The following shall determine the distribution of actions between the seat of the central division and",
                    "its sections.",
                    "(a) Where an action involves a single patent having a single classification, the Registry shall allocate the",
                    "action to the seat or the section of the central division appropriate to the classification of the patent",
                    "according to Annex II of the Agreement. The Registry shall assign the action to a panel in accordance",
                    "with Rule 345.3.",
                    "- 29 -",
                    "(b) Where an action involves more than one patent and a majority of the patents have a single",
                    "classification appropriate to the seat or a single section of the central division according to Annex II of",
                    "the Agreement, the Registry shall allocate the action to the seat or that section of the central division.",
                    "The Registry shall assign the action to a panel in accordance with Rule 345.3.",
                    "(c) Where neither paragraph (a) nor (b) applies, especially where",
                    "(i) the action involves a single patent having more than one classification or",
                    "(ii) where the action involves more than one patent and no majority of the patents have a single",
                    "classification corresponding to the seat or to one of the sections of the central division,",
                    "the Registry shall assign the action in accordance with Rule 345.3 to the panel at the seat or the section",
                    "appropriate to the first classification of either the single patent or, where the action involves more than",
                    "one patent, the patent first listed in the Statement of claim, according to Annex II of the Agreement. If",
                    "the presiding judge of the respective panel considers that the reference of the action is appropriate, he",
                    "shall accept it. If he considers otherwise, he shall instruct the Registry to refer the action in accordance",
                    "with Rule 345.3 to the presiding judge of a panel of either the seat or the other section of the central",
                    "division he considers appropriate, who shall likewise consider whether the re-allocation of the action is",
                    "appropriate. If that presiding judge considers otherwise, he shall inform the President of the Court of",
                    "First Instance, who shall allocate the action to the seat or the section of the central division he considers",
                    "appropriate. The Registry shall assign the action to a panel in accordance with Rule 345.3.",
                    "4. The action shall be regarded as having commenced before the Court as from the date of receipt",
                    "attributed to the Statement of claim.",
                    "Relation with Agreement: Article 7(2), Article 10"
                  ]
                },
                {
                  "rule_number": "18",
                  "rule_title": "Designation of the judge-rapporteur",
                  "paragraphs": [
                    "The presiding judge of the panel to which the action has been assigned [Rule 17.2] shall designate one",
                    "legally qualified judge of the panel as judge-rapporteur. The presiding judge may designate himself as",
                    "judge-rapporteur. The Registry shall as soon as practicable notify the claimant and defendant of the",
                    "identity of the judge-rapporteur.",
                    "PROCEDURE WHEN THE DEFENDANT RAISES A PRELIMINARY OBJECTION"
                  ]
                },
                {
                  "rule_number": "19",
                  "rule_title": "Preliminary objection",
                  "paragraphs": [
                    "1. Within one month of service of the Statement of claim, the defendant may lodge a Preliminary",
                    "objection concerning:",
                    "(a) the jurisdiction and competence of the Court, including any objection that an opt-out pursuant to",
                    "Rule 5 applies to the patent that is the subject of the proceedings;",
                    "(b) the competence of the division indicated by the claimant [Rule 13.1(i)];",
                    "(c) the language of the Statement of claim [Rule 14].",
                    "2. A Preliminary objection shall contain:",
                    "(a) particulars in accordance with Rule 24(a) to (c);",
                    "- 30 -",
                    "(b) the decision or order sought by the defendant;",
                    "(c) the grounds upon which the Preliminary objection is based; and",
                    "(d) where appropriate the facts and evidence relied on.",
                    "3. The Preliminary objection shall be drawn up in the language pursuant to Rule 14.",
                    "4. If the action has been commenced before a regional division the defendant may by a Preliminary",
                    "objection request a transfer of the action to the central division pursuant to Article 33(2) of the",
                    "Agreement. The Preliminary objection shall in such a case contain all facts and evidence supporting the",
                    "existence of the same infringement in the territories of three or more regional divisions.",
                    "5. The Registry shall as soon as practicable invite the claimant to comment on the Preliminary objection.",
                    "Where applicable, the claimant may of his own motion correct any deficiency [paragraph 1(b) or (c)],",
                    "within 14 days of service of notification of the Preliminary objection. Alternatively the claimant may",
                    "submit written comments within the same period. The judge-rapporteur shall be informed of any",
                    "correction made or written comments submitted by the claimant. If the deficiency referred to in",
                    "paragraph 1(b) is corrected and the claimant has indicated another division, which is competent, the",
                    "judge-rapporteur shall refer the action to the division indicated by the claimant.",
                    "6. The period for lodging the Statement of defence [Rule 23] shall not be affected by the lodging of a",
                    "Preliminary objection, unless the judge-rapporteur decides otherwise.",
                    "7. The defendant’s failure to lodge a Preliminary objection within the time period referred to in",
                    "paragraph 1 shall be treated as a submission to the jurisdiction and competence of the Court and the",
                    "competence of the division chosen by the claimant."
                  ]
                },
                {
                  "rule_number": "20",
                  "rule_title": "Decision or order on a Preliminary objection",
                  "paragraphs": [
                    "1. As soon as practicable after the expiry of the period referred to in Rule 19.5, the judge-rapporteur",
                    "shall decide the Preliminary objection. The judge-rapporteur shall give the parties an opportunity to be",
                    "heard. The decision shall include instructions to the parties and to the Registry concerning the next step",
                    "in the proceedings.",
                    "2. Where the Preliminary objection is to be dealt with in the main proceedings, the judge-rapporteur",
                    "shall inform the parties."
                  ]
                },
                {
                  "rule_number": "21",
                  "rule_title": "Appeal against decision or order on a Preliminary objection",
                  "paragraphs": [
                    "1. A decision of the judge-rapporteur allowing the Preliminary objection may be appealed pursuant to",
                    "Rule 220.1(a). An order of the judge-rapporteur rejecting the Preliminary objection may only be",
                    "appealed pursuant to Rule 220.2.",
                    "2. If an appeal is lodged, proceedings at first instance may be stayed by the judge-rapporteur or the Court",
                    "of Appeal on a reasoned request by a party.",
                    "VALUE-BASED FEE FOR THE INFRINGEMENT ACTION"
                  ]
                },
                {
                  "rule_number": "22",
                  "rule_title": "Determination of value-based fee for the infringement action",
                  "paragraphs": [
                    "1. The value of the infringement action shall be determined by the judge-rapporteur under Rule 370.6,",
                    "taking into account the value as assessed by the parties, by way of an order during the interim procedure.",
                    "- 31 -",
                    "2. Where the value of the infringement action exceeds EUR 500.000, the claimant shall pay a value-",
                    "based fee for the infringement action, in accordance with Part 6. Rule 16.3 to .5 shall apply mutatis",
                    "mutandis.",
                    "STATEMENT OF DEFENCE"
                  ]
                },
                {
                  "rule_number": "23",
                  "rule_title": "Lodging of the Statement of defence",
                  "paragraphs": [
                    "The defendant shall lodge a Statement of defence within three months of service of the Statement of",
                    "claim."
                  ]
                },
                {
                  "rule_number": "24",
                  "rule_title": "Contents of the Statement of defence",
                  "paragraphs": [
                    "The Statement of defence shall contain:",
                    "(a) the names of the defendant and of the defendant’s representative;",
                    "(b) postal and electronic addresses for service on the defendant and the names and addresses of the",
                    "persons authorised to accept service;",
                    "(c) the action number of the file;",
                    "(d) an indication whether the defendant has lodged a Preliminary objection [Rule 19];",
                    "(e) an indication of the facts relied on, including any challenge to the facts relied on by the claimant;",
                    "(f) the evidence relied on [Rule 170.1], where available, and an indication of any further evidence which",
                    "will be offered in support;",
                    "(g) the reasons why the action shall fail, arguments of law and any argument arising from the provisions",
                    "of Article 28 of the Agreement and where appropriate any challenge to the claimant’s proposed claim",
                    "interpretation;",
                    "(h) an indication of any order the defendant will seek in respect of the infringement action during the",
                    "interim procedure [Rule 104(e)];",
                    "(i) a statement whether the defendant disputes the claimant’s assessment of the value of the infringement",
                    "action and the grounds for such dispute; and",
                    "(j) a list of the documents, including any witness statements, referred to in the Statement of",
                    "defence together with any request that all or part of any such document need not be translated",
                    "and/or any request pursuant to Rule 262.2 or Rule 262A. Rule 13.2 and .3 shall apply mutatis mutandis."
                  ]
                },
                {
                  "rule_number": "25",
                  "rule_title": "Counterclaim for revocation",
                  "paragraphs": [
                    "1. If the Statement of defence includes an assertion that the patent alleged to be infringed is invalid the",
                    "Statement of defence shall include a Counterclaim against the proprietor of the patent for revocation of",
                    "said patent in accordance with Rule 42. The Counterclaim for revocation shall contain:",
                    "(a) an indication of the extent to which revocation of the patent is requested;",
                    "(b) one or more grounds for revocation, which shall as far as possible be supported by arguments of law,",
                    "and where appropriate an explanation of the defendant’s proposed claim construction;",
                    "- 32 -",
                    "(c) an indication of the facts relied on;",
                    "(d) the evidence relied on, where available, and an indication of any further evidence which will be",
                    "offered in support;",
                    "(e) an indication of any order the defendant will seek during the interim procedure [Rule 104(e)];",
                    "(f) a statement of his position, if any, on the options provided for in Article 33(3) of the Agreement and",
                    "Rule 37.4;",
                    "(g) a list of the documents, including any witness statements, referred to in the Counterclaim for",
                    "revocation together with any request that all or part of any such documents need not be translated and/or",
                    "any request pursuant to Rule 262.2 or Rule 262A. Rule 13.2 and .3 shall apply mutatis mutandis; and",
                    "(h) insofar as the proprietor of the patent is not claimant in the infringement proceedings, the information",
                    "required by Rule 13.1(b) and (d) in respect of said proprietor.",
                    "2. Where the claimant is not the proprietor or not the only proprietor of the patent concerned, the",
                    "Registry shall as soon as practicable serve a copy of the Counterclaim for revocation on the relevant",
                    "proprietor in accordance with Rule 13.1(e) and shall supply a copy of each document referred to in",
                    "paragraph 1(h). Rule 271 shall apply mutatis mutandis. The proprietor in question shall become a party",
                    "to the revocation proceedings and shall be treated as defendant in all subsequent proceedings. The",
                    "proprietor shall provide details pursuant to Rule 13.1(e) if not already provided by the claimant."
                  ]
                },
                {
                  "rule_number": "26",
                  "rule_title": "Fee for the Counterclaim for revocation",
                  "paragraphs": [
                    "The defendant shall pay the fee for the Counterclaim for revocation in accordance with Part 6. Rule 15.2",
                    "shall apply mutatis mutandis."
                  ]
                },
                {
                  "rule_number": "27",
                  "rule_title": "Examination as to formal requirements of the Statement of defence and Counterclaim",
                  "paragraphs": [
                    "for revocation",
                    "1. The Registry shall, as soon as practicable after the lodging of the Statement of defence:",
                    "(a) examine whether the requirements of Rule 24(a) to (d) have been complied with; and",
                    "(b) if the Statement of defence includes a Counterclaim for revocation, examine whether the",
                    "requirements of Rule 25.1(g) and (h), and the obligation to pay the fee pursuant to Rule 26 has been",
                    "complied with.",
                    "2. If the Registry considers that the Statement of defence or the Counterclaim for revocation does not",
                    "comply with any of the requirements referred to in paragraph 1, it shall as soon as practicable invite the",
                    "defendant to:",
                    "(a) correct the deficiencies noted, within 14 days of service of such notification; and",
                    "(b) where applicable, pay the fee for the Counterclaim for revocation, within said 14 days.",
                    "3. The Registry shall at the same time inform the defendant that if the defendant fails to correct the",
                    "deficiencies or pay the fee within the time stated, a decision by default may be given, in accordance with",
                    "Rule 355.",
                    "- 33 -",
                    "4. If the defendant fails to correct the deficiencies or to pay the fee for the Counterclaim for revocation,",
                    "as appropriate, within said 14 days, the Registry shall inform the judge-rapporteur who may give a",
                    "decision by default. He may give the defendant an opportunity to be heard beforehand."
                  ]
                },
                {
                  "rule_number": "28",
                  "rule_title": "Further schedule",
                  "paragraphs": [
                    "As soon as practicable after service of the Statement of defence, the judge-rapporteur shall, after",
                    "consulting the parties, set a date and time for an interim conference (where necessary [Rule 101.1]) and",
                    "set a date for the oral hearing. The judge-rapporteur may set one alternative date.",
                    "DEFENCE TO THE COUNTERCLAIM FOR REVOCATION, REPLY TO THE STATEMENT OF THE DEFENCE",
                    "AND APPLICATION TO AMEND THE PATENT AND REJOINDER TO THE REPLY"
                  ]
                },
                {
                  "rule_number": "29",
                  "rule_title": "Lodging of Defence to the Counterclaim for revocation, Reply to the Statement of",
                  "paragraphs": [
                    "defence and Rejoinder to the Reply",
                    "(a) Within two months of service of a Statement of defence which includes a Counterclaim for",
                    "revocation, the claimant shall lodge a Defence to the Counterclaim for revocation together with any",
                    "Reply to the Statement of defence and any Application to amend the patent pursuant to Rule 30, if",
                    "applicable.",
                    "(b) Within two months of service of a Statement of defence which does not include a Counterclaim for",
                    "revocation, the claimant may lodge a Reply to the Statement of defence.",
                    "(c) Within one month of service of a Reply to the Statement of defence which does not include a",
                    "Counterclaim for revocation the defendant may lodge a Rejoinder to the Reply to the Statement of",
                    "defence. The Rejoinder to the Reply to the Statement of defence shall be limited to a response to the",
                    "matters raised in the Reply to the Statement of defence.",
                    "(d) Within two months of service of the Defence to Counterclaim the defendant may lodge a Reply to",
                    "the Defence to the Counterclaim together with any Rejoinder to the Reply to the Statement of defence",
                    "and any Defence to an Application to amend the patent pursuant to Rule 32, if applicable.",
                    "(e) Within one month of the service of the Reply to the Defence to the Counterclaim, the claimant may",
                    "lodge a Rejoinder to the Reply together with any Reply to the Defence to an Application to amend the",
                    "patent pursuant to Rule 32, if applicable. The Rejoinder to the Reply to the Statement of defence shall",
                    "be limited to a response to the matters raised in the Reply to the Statement of defence.",
                    "(f) Where the claimant is not the proprietor of the patent, all references to the claimant in this Rule 29",
                    "regarding an Application to amend the patent shall be read as including the proprietor."
                  ]
                },
                {
                  "rule_number": "29A",
                  "rule_title": "Contents of the Defence to the Counterclaim",
                  "paragraphs": [
                    "The Defence to the Counterclaim for revocation shall contain:",
                    "(a) an indication of the facts relied on, including any challenge to the facts relied on by the defendant;",
                    "(b) the evidence relied on [Rule 170.1], where available, and an indication of any further evidence which",
                    "will be offered in support;",
                    "(c) the reasons why the Counterclaim for revocation shall fail, including arguments of law and any",
                    "argument as to why any dependent claim of the patent is independently valid;",
                    "- 34 -",
                    "(d) an indication of any order the claimant and the proprietor will seek in respect of the revocation action",
                    "at the interim conference [Rule 104(e)];",
                    "(e) the claimant’s and the proprietor’s response to the defendant’s choice of option, if any, provided for",
                    "in Article 33(3) of the Agreement and Rule 37.4; and",
                    "(f) a list of the documents, including any witness statements, referred to in the Defence to the",
                    "Counterclaim together with any request that all or part of any such document shall not be",
                    "translated and/or any request pursuant to Rule 262.2 or Rule 262A. Rule 13.2 and .3 shall apply mutatis",
                    "mutandis."
                  ]
                },
                {
                  "rule_number": "30",
                  "rule_title": "Application to amend the patent",
                  "paragraphs": [
                    "1. The Defence to the Counterclaim for revocation may include an Application by the proprietor of the",
                    "patent to amend the patent which shall contain:",
                    "(a) the proposed amendments of the claims of the patent concerned and/or specification, including where",
                    "applicable and appropriate one or more alternative sets of claims (auxiliary requests), in the language in",
                    "which the patent was granted; where the language of the proceedings [Rule 14.3] is not the language in",
                    "which the patent was granted, the proprietor shall lodge a translation of the proposed amendments in the",
                    "language of the proceedings, and where the patent is a European patent with unitary effect in the",
                    "language of the defendant’s domicile in a Member State of the EU or of the place of the alleged",
                    "infringement or threatened infringement in a Contracting Member State if so requested by the defendant;",
                    "(b) an explanation as to why the amendments satisfy the requirements of Articles 84 and 123(2), (3) EPC",
                    "and why the proposed amended claims are valid and, if applicable, why they are infringed; and",
                    "(c) an indication whether the proposals are conditional or unconditional; the proposed amendments, if",
                    "conditional, must be reasonable in number in the circumstances of the case.",
                    "2. Any subsequent request to amend the patent may only be admitted into the proceedings with the",
                    "permission of the Court.",
                    "3. Where other proceedings involving the patent subject to an Application to amend the patent are",
                    "pending, the claimant shall notify the Court or the authority in question that such an Application has",
                    "been made and provide the information required in paragraph 1(a).",
                    "DEFENCE TO THE APPLICATION TO AMEND THE PATENT"
                  ]
                },
                {
                  "rule_number": "32",
                  "rule_title": "Lodging of the Defence to the Application to amend the patent, the Reply to the Defence",
                  "paragraphs": [
                    "and the Rejoinder to the Reply",
                    "1. Within two months of service of an Application to amend the patent, the defendant shall lodge a",
                    "Defence to the Application to amend the patent setting out whether he opposes the Application to amend",
                    "the patent and, if so, why:",
                    "(a) the proposed amendments are not allowable; and",
                    "(b) the patent cannot be maintained as requested.",
                    "2. Where appropriate in view of the proposed amendments, the Defence to the Application to amend the",
                    "patent may contain submissions in accordance with Rule 44(d) to (h) and alternative non-infringement",
                    "submissions.",
                    "- 35 -",
                    "3. The proprietor may lodge a Reply to the Defence to the Application to amend the patent within one",
                    "month of service of the Defence and the defendant may within one month of the service of the Reply",
                    "lodge a Rejoinder to the Reply. The Rejoinder shall be limited to the matters raised in the Reply.",
                    "APPLICATION FOR ALLOCATING A TECHNICALLY QUALIFIED JUDGE TO THE PANEL"
                  ]
                },
                {
                  "rule_number": "33",
                  "rule_title": "Application by a party for allocating a technically qualified judge",
                  "paragraphs": [
                    "1. Any party to the proceedings may lodge an Application for allocating a technically qualified judge to",
                    "the panel which shall contain an indication of the relevant field of technology.",
                    "2. The Application shall be lodged as early as possible in the written procedure. An Application lodged",
                    "after the closure of the written procedure [Rule 35] shall only be granted if justified in view of changed",
                    "circumstances, such as new submissions presented by the other party, and allowed by the Court.",
                    "3. If the requirements of paragraphs 1 and 2 have been complied with, the President of the Court of First",
                    "Instance shall allocate a technically qualified judge to the panel, after consulting the judge-rapporteur."
                  ]
                },
                {
                  "rule_number": "34",
                  "rule_title": "Request by the judge-rapporteur for allocating a technically qualified judge",
                  "paragraphs": [
                    "1. The judge-rapporteur may at any time during the written procedure, after consulting the presiding",
                    "judge and the parties, request the President of the Court of First Instance to allocate a technically",
                    "qualified judge to the panel.",
                    "2. Where a technically qualified judge is allocated to the panel, the judge-rapporteur may at any time",
                    "consult the technically qualified judge.",
                    "LAST STEPS IN THE WRITTEN PROCEDURE"
                  ]
                },
                {
                  "rule_number": "35",
                  "rule_title": "Closure of the written procedure",
                  "paragraphs": [
                    "Following the exchange of written pleadings in accordance with Rule 12.1 and, where applicable, in",
                    "accordance with Rule 12.2 to .4, the judge-rapporteur shall:",
                    "(a) inform the parties of the date on which he intends to close the written procedure, without prejudice",
                    "to Rule 36; and",
                    "(b) where an interim conference is necessary [Rules 28 and 101.1], confirm the date and the time set for",
                    "the interim conference [Rule 28] or inform the parties that an interim conference will not be held."
                  ]
                },
                {
                  "rule_number": "36",
                  "rule_title": "Further exchanges of written pleadings",
                  "paragraphs": [
                    "Without prejudice to the powers of the judge-rapporteur pursuant to Rule 110.1, on a reasoned request",
                    "by a party lodged before the date on which the judge-rapporteur intends to close the written procedure",
                    "[Rule 35(a)], the judge-rapporteur may allow the exchange of further written pleadings, within a period",
                    "to be specified. Where the exchange of further written pleadings is allowed, the written procedure shall",
                    "be deemed closed upon expiry of the specified period."
                  ]
                },
                {
                  "rule_number": "37",
                  "rule_title": "Application of Article 33(3) of the Agreement",
                  "paragraphs": [
                    "1. As soon as practicable after the closure of the written procedure the panel shall decide by way of order",
                    "how to proceed with respect to the application of Article 33(3) of the Agreement. The parties shall be",
                    "- 36 -",
                    "given an opportunity to be heard [Rule 264]. The panel shall set out in its order brief reasons for its",
                    "decision.",
                    "2. The Panel may by order take an earlier decision if appropriate having considered the parties’ pleadings",
                    "and having given the parties an opportunity to be heard [Rule 264].",
                    "3. Where the panel decides to proceed in accordance with Article 33(3)(a) of the Agreement, the judge-",
                    "rapporteur shall request the President of the Court of First Instance to allocate to the panel a technically",
                    "qualified judge if not already allocated pursuant to Rules 33 and 34.",
                    "4. Where the panel decides to proceed in accordance with Article 33(3)(b) of the Agreement, the panel",
                    "may stay the infringement proceedings pending a final decision in the revocation proceedings and shall",
                    "stay the infringement proceedings where there is a high likelihood that the relevant claims of the patent",
                    "will be held to be invalid on any ground by the final decision in the revocation proceedings.",
                    "5. Where the panel decides to proceed in accordance with Article 33(3)(b) of the Agreement and not to",
                    "stay the proceedings, the judge-rapporteur of the regional or local division shall communicate to the",
                    "central division the dates set for the interim conference and for the oral hearing according to Rule 28.",
                    "COUNTERCLAIM FOR REVOCATION REFERRED TO THE CENTRAL DIVISION UNDER ARTICLE",
                    "33(3)(B) OF THE AGREEMENT"
                  ]
                },
                {
                  "rule_number": "38",
                  "rule_title": "Written procedure when the central division deals with a Counterclaim for revocation",
                  "paragraphs": [
                    "under Article 33(3)(b) of the Agreement",
                    "When a Counterclaim for revocation is referred to the central division, it shall be dealt with as follows:",
                    "(a) Rule 17.2 and .3 shall apply mutatis mutandis;",
                    "(b) Rule 18 shall apply mutatis mutandis: the presiding judge of the panel to which the Counterclaim",
                    "for revocation has been assigned shall designate one legally qualified judge of the panel as judge-",
                    "rapporteur;",
                    "(c) The judge-rapporteur shall give any further directions necessary for the future conduct of the written",
                    "procedure before the central division;",
                    "(d) Rule 28 shall apply mutatis mutandis: the judge-rapporteur shall after consulting the parties set a",
                    "date and a time for the interim conference (where necessary [Rules 28 and 101]) and set a date, and one",
                    "alternative date, for the oral hearing."
                  ]
                },
                {
                  "rule_number": "39",
                  "rule_title": "Language of the proceedings before the central division",
                  "paragraphs": [
                    "1. Where the language of the proceedings before the local division or the regional division which",
                    "referred the Counterclaim for revocation to the central division is not the language in which the patent",
                    "was granted, the judge-rapporteur may order that the parties lodge, within a period of one month, a",
                    "translation in the language in which the patent was granted of any written pleadings and such other",
                    "documents lodged during the written procedure as the judge-rapporteur may direct.",
                    "2. Where appropriate, the judge-rapporteur may specify in his order that only excerpts of parties’ written",
                    "pleadings and other documents shall be translated.",
                    "- 37 -",
                    "3. Where the language of the proceedings before the local division or the regional division is the",
                    "language in which the patent was granted the pleadings served in accordance with Rules 24, 25, 29, 29a,",
                    "30 and 32 shall stand."
                  ]
                },
                {
                  "rule_number": "40",
                  "rule_title": "Accelerated proceedings before the central division",
                  "paragraphs": [
                    "The judge-rapporteur shall accelerate proceedings before the central division where",
                    "(a) an Application for provisional measures has been lodged [Rule 206]; or",
                    "(b) the regional or local division has referred the Counterclaim for revocation to the central division and",
                    "where the infringement action has not been stayed.",
                    "In the latter case, the judge-rapporteur of the panel of the central division shall endeavour to set a date",
                    "for the oral hearing on the revocation action prior to the date of the oral hearing of the infringement",
                    "action.",
                    "ACTION REFERRED TO THE CENTRAL DIVISION UNDER ARTICLE 33(3)(C) OF THE AGREEMENT"
                  ]
                },
                {
                  "rule_number": "41",
                  "rule_title": "Written procedure when the central division deals with the action under Article 33(3)(c)",
                  "paragraphs": [
                    "of the Agreement",
                    "When an action is referred to the central division under Article 33(3)(c) of the Agreement, it shall be",
                    "dealt with as follows:",
                    "(a) Rule 17.2 and .3 shall apply mutatis mutandis. The parties may request that the action be heard by a",
                    "single judge;",
                    "(b) Rule 18 shall apply mutatis mutandis: the presiding judge of the panel to which the action has been",
                    "assigned shall designate one judge of the panel as judge-rapporteur;",
                    "(c) dates already set under Rule 28 shall be confirmed wherever possible;",
                    "(d) Rule 39 shall apply mutatis mutandis: the judge-rapporteur may order that the parties lodge a",
                    "translation in the language in which the patent was granted of any written pleadings lodged during the",
                    "written procedure; where appropriate, the judge-rapporteur may specify in his order that only excerpts",
                    "of parties’ written pleadings and other documents shall be translated. Otherwise the pleadings lodged",
                    "during the written procedure shall stand;",
                    "(e) The judge-rapporteur shall give any further directions necessary for the future conduct of the written",
                    "procedure before the central division."
                  ]
                }
              ]
            },
            {
              "section_number": "2",
              "section_title": "REVOCATION ACTION",
              "rules": [
                {
                  "rule_number": "42",
                  "rule_title": "Action to be directed against the patent proprietor",
                  "paragraphs": [
                    "1. Any action for the revocation of a patent shall be directed against the proprietor of the patent.",
                    "2. If the action for revocation is directed against the proprietor in accordance with Rule 8.6 (“the",
                    "registered proprietor”) but the registered proprietor is not a proprietor within the meaning of Rule 8.5(a)",
                    "or (b) (“the Rule 8.5 proprietor”) each such registered proprietor shall as soon as practicable after service",
                    "of the Statement for revocation apply to the Court pursuant to Rule 305.1(c) for the substitution of the",
                    "registered proprietor by the Rule 8.5 proprietor.",
                    "- 38 -",
                    "Relation with Agreement: Articles 47(5) and 65(1)"
                  ]
                },
                {
                  "rule_number": "43",
                  "rule_title": "Exchange of written pleadings (revocation action)",
                  "paragraphs": [
                    "1. The written procedure shall consist of:",
                    "(a) the lodging of a Statement for revocation (by the claimant) [Rule 44]; and",
                    "(b) the lodging of a Defence to revocation (by the defendant) [Rule 49]; and optionally",
                    "(c) the lodging of a Reply to the Defence to revocation (by the claimant) [Rule 51];",
                    "(d) the lodging of a Rejoinder to the Reply (by the defendant) [Rule 52].",
                    "2. The Defence to revocation may include:",
                    "(a) an Application to amend the patent; and",
                    "(b) a Counterclaim for infringement by the proprietor of the patent.",
                    "3. If an Application to amend the patent is lodged, the claimant shall lodge a Defence to the Application",
                    "to amend the patent. The defendant may lodge a Reply to the Defence to the Application. The claimant",
                    "may lodge a Rejoinder to the Reply. The Rejoinder shall be limited to a response to the matters raised",
                    "in the Reply.",
                    "4. If a Counterclaim for infringement is lodged, the claimant shall lodge a Defence to the Counterclaim",
                    "for infringement [Rule 56], the defendant may lodge a Reply to the Defence to the Counterclaim",
                    "[Rule 56.3] and the claimant may lodge a Rejoinder to the Reply [Rule 56.4].",
                    "5. Rule 12.5 shall apply.",
                    "STATEMENT FOR REVOCATION"
                  ]
                },
                {
                  "rule_number": "44",
                  "rule_title": "Contents of the Statement for revocation",
                  "paragraphs": [
                    "The claimant shall, subject to point (b), lodge a Statement for revocation at the Registry in accordance",
                    "with Article 7(2) of the Agreement and Annex II thereto. The Statement for revocation shall contain:",
                    "(a) particulars in accordance with Rule 13.1(a) to (d) and (g), (h);",
                    "(b) where the parties have agreed to bring the action before a local division or a regional division in",
                    "accordance with Article 33(7) of the Agreement, an indication of the division which shall hear the action,",
                    "accompanied by evidence of the defendant’s agreement;",
                    "(c) where applicable, an indication that the action shall be heard by a single judge [Article 8(7) of the",
                    "Agreement], accompanied by evidence of the defendant’s agreement;",
                    "(d) an indication of the extent to which revocation of the patent is requested;",
                    "(e) one or more grounds for revocation, which shall as far as possible be supported by arguments of law,",
                    "and where appropriate an explanation of the claimant’s proposed claim construction;",
                    "(f) an indication of the facts relied on;",
                    "- 39 -",
                    "(g) the evidence relied on, where available, and an indication of any further evidence which will be",
                    "offered in support;",
                    "(h) an indication of any order the claimant will seek during the interim procedure [Rule 104(e)];",
                    "and",
                    "(i) a list of the documents, including any witness statements, referred to in the Statement",
                    "for revocation together with any request that all or part of any such document need not be",
                    "translated and/or any request pursuant to Rule 262.2 and Rule 262A. Rule 13.2 and .3 shall apply mutatis",
                    "mutandis."
                  ]
                },
                {
                  "rule_number": "45",
                  "rule_title": "Language of the Statement for revocation",
                  "paragraphs": [
                    "1. Subject to paragraph 2, the Statement for revocation shall be drawn up in the language in which the",
                    "patent was granted.",
                    "2. Where the parties have agreed to bring the action before a local or a regional division in accordance",
                    "with Article 33(7) of the Agreement, the Statement for revocation shall be drawn up in one of the",
                    "languages referred to in Rule 14.1(a) and (b).",
                    "Relation with Agreement: Article 49"
                  ]
                },
                {
                  "rule_number": "46",
                  "rule_title": "Fee for the revocation action",
                  "paragraphs": [
                    "The claimant shall pay the fee for the revocation action in accordance with Part 6. Rule 15.2 shall apply",
                    "mutatis mutandis.",
                    "Relation with Agreement: Articles 70 and 71"
                  ]
                },
                {
                  "rule_number": "47",
                  "rule_title": "Examination as to formal requirements, recording in the register, assignment (Court of",
                  "paragraphs": [
                    "First Instance, revocation action) and designation of the judge-rapporteur",
                    "1. Rules 16 to 18 shall apply mutatis mutandis.",
                    "2. The Registrar shall notify the European Patent Office that the patent in question is subject to an action",
                    "for revocation.",
                    "Relation with Agreement: Articles 10 and 33"
                  ]
                },
                {
                  "rule_number": "48",
                  "rule_title": "Preliminary objection",
                  "paragraphs": [
                    "Rule 19.1 to .3 and .5 to .7 as well as Rules 20 and 21 shall apply mutatis mutandis.",
                    "DEFENCE TO REVOCATION"
                  ]
                },
                {
                  "rule_number": "49",
                  "rule_title": "Lodging of the Defence to revocation",
                  "paragraphs": [
                    "1. The defendant shall lodge a Defence to revocation within two months of service of the Statement for",
                    "revocation.",
                    "2. The Defence to revocation may include:",
                    "(a) an Application to amend the patent;",
                    "- 40 -",
                    "(b) a Counterclaim for infringement."
                  ]
                },
                {
                  "rule_number": "50",
                  "rule_title": "Contents of the Defence to revocation and Counterclaim for infringement",
                  "paragraphs": [
                    "1. The Defence to revocation shall contain the matters referred to in Rule 24(a) to (c).",
                    "Rule 29A(a) to (d) and (f) shall apply mutatis mutandis.",
                    "2. Any Application to amend the patent shall contain the matters referred to in Rule 30.1(a), (c) and an",
                    "explanation as to why the amendments satisfy the requirements of Articles 84 and 123(2), (3) EPC and",
                    "why the proposed amended claims are valid. Rule 30.2 shall apply.",
                    "3. Any Counterclaim for infringement shall contain the matters referred to in Rule 13.1(k) to (q).",
                    "Rule 13.2 and .3 shall apply."
                  ]
                },
                {
                  "rule_number": "51",
                  "rule_title": "Reply to Defence to revocation",
                  "paragraphs": [
                    "Within two months of service of the Defence to revocation the claimant may lodge a Reply to the",
                    "Defence to revocation together with any Defence to an Application to amend the patent pursuant to",
                    "Rule 43.3 and 55 as well as any Defence to the Counterclaim for infringement pursuant to Rule 56.1, if",
                    "applicable."
                  ]
                },
                {
                  "rule_number": "52",
                  "rule_title": "Rejoinder to the Reply",
                  "paragraphs": [
                    "Within one month of the service of the Reply the defendant may lodge a Rejoinder to the Reply to the",
                    "Defence to revocation together with any Reply to the Defence to an Application to amend the patent",
                    "pursuant to Rule 43.3 and 55 as well as any Reply to the Defence to the Counterclaim for infringement",
                    "pursuant to Rule 56.3, if applicable. The Rejoinder shall be limited to a response to the matters raised in",
                    "the Reply."
                  ]
                },
                {
                  "rule_number": "53",
                  "rule_title": "Fee for the Counterclaim for infringement",
                  "paragraphs": [
                    "The defendant shall pay the fixed fee and, where applicable, the value based fee for the Counterclaim",
                    "for infringement in accordance with Part 6. Rule 15 and Rule 16.3 to 5 shall apply mutatis mutandis."
                  ]
                },
                {
                  "rule_number": "54",
                  "rule_title": "Examination as to formal requirements and further schedule",
                  "paragraphs": [
                    "Rules 27 and 28 shall apply mutatis mutandis.",
                    "DEFENCE TO THE APPLICATION TO AMEND THE PATENT AND DEFENCE TO THE COUNTERCLAIM",
                    "FOR INFRINGEMENT"
                  ]
                },
                {
                  "rule_number": "55",
                  "rule_title": "Lodging of the Defence to the Application to amend the patent, the Reply to the Defence",
                  "paragraphs": [
                    "and the Rejoinder to the Reply",
                    "Rule 32 shall apply mutatis mutandis."
                  ]
                },
                {
                  "rule_number": "56",
                  "rule_title": "Lodging of the Defence to the Counterclaim for infringement",
                  "paragraphs": [
                    "1. Within two months of service of a Counterclaim for infringement, the claimant shall lodge a Defence",
                    "to the Counterclaim for infringement.",
                    "- 41 -",
                    "2. The Defence to the Counterclaim for infringement shall contain the matters referred to in Rule 24.1(e)",
                    "to (h) and (j) and a statement whether the claimant disputes the defendant’s assessment of the value of",
                    "the Counterclaim pursuant to Rule 50.3 and the reasons for such dispute.",
                    "3. The defendant may lodge a Reply to the Defence to the Counterclaim for infringement within one",
                    "month.",
                    "4. Within one month of the service of the Reply to the Defence to the Counterclaim for infringement the",
                    "claimant may lodge a Rejoinder to the Reply together with any Rejoinder to the Reply to the Defence",
                    "to the Application to amend the patent pursuant to Rule 43.3 and 55. The Rejoinder shall be limited to",
                    "matters raised in the Reply."
                  ]
                },
                {
                  "rule_number": "57",
                  "rule_title": "Request for allocating a technically qualified judge",
                  "paragraphs": [
                    "Rules 33 and 34 shall apply mutatis mutandis."
                  ]
                },
                {
                  "rule_number": "58",
                  "rule_title": "Closure of the written procedure subject to the possible exchange of further pleadings",
                  "paragraphs": [
                    "Rules 35 and 36 shall apply mutatis mutandis."
                  ]
                },
                {
                  "rule_number": "60",
                  "rule_title": "Determination of the value-based fee for the Counterclaim for infringement",
                  "paragraphs": [
                    "1. The value of the Counterclaim for infringement shall be determined by the judge-rapporteur under",
                    "Rule 370.6, taking into account the value as assessed by the parties, by way of an order during the",
                    "interim procedure.",
                    "2. Where the value of the Counterclaim for infringement exceeds EUR 500.000, the defendant shall pay",
                    "a value-based fee in accordance with Part 6. Rule 16.3 to .5 shall apply mutatis mutandis."
                  ]
                }
              ]
            },
            {
              "section_number": "3",
              "section_title": "ACTION FOR DECLARATION OF NON-INFRINGEMENT",
              "rules": [
                {
                  "rule_number": "61",
                  "rule_title": "Declaration of non-infringement",
                  "paragraphs": [
                    "1. A declaration that the performance of a specific act does not, or a proposed act would not, constitute",
                    "an infringement of a patent may be made by the Court in proceedings between the person doing or",
                    "proposing to do the act and the patent proprietor or licensee entitled to commence infringement",
                    "proceedings pursuant to Article 47 of the Agreement, if the patent proprietor or such licensee has",
                    "asserted that the act is an infringement, or, if no such assertion has been made by the patent proprietor",
                    "or licensee, if:",
                    "(a) that person has applied in writing to the proprietor or licensee for a written acknowledgment to the",
                    "effect of the declaration claimed, and has provided him with full particulars in writing of the act in",
                    "question; and",
                    "(b) the proprietor or licensee has refused or failed to give any such acknowledgment within one month.",
                    "2. The action for a declaration shall be directed against the proprietor of the patent or the licensee who",
                    "has asserted an infringement or refused or failed to give an acknowledgement pursuant to",
                    "paragraph 1(b).",
                    "3. If the action for a declaration of non-infringement is directed against the proprietor of the patent in",
                    "accordance with Rule 8.6 (“the registered proprietor”) but the registered proprietor is not a proprietor",
                    "within the meaning of Rule 8.5(a) or (b) (“the Rule 8.5 proprietor”) each such registered proprietor shall",
                    "- 42 -",
                    "as soon as possible after service of the Statement for a declaration of non-infringement apply to the",
                    "Court pursuant to Rule 305.1(c) for the substitution of the registered proprietor by the Rule 8.5",
                    "proprietor."
                  ]
                },
                {
                  "rule_number": "62",
                  "rule_title": "Exchange of written pleadings (action for declaration of non-infringement)",
                  "paragraphs": [
                    "1. The written procedure shall consist of:",
                    "(a) the lodging of a Statement for a declaration of non-infringement (by the claimant) [Rule 63];",
                    "(b) the lodging of a Defence to the Statement for a declaration of non-infringement (by the defendant)",
                    "[Rules 67 and 68]; and, optionally",
                    "(c) the lodging of a Reply to the Defence to the Statement for a declaration of non-infringement",
                    "[Rule 69];",
                    "(d) the lodging of a Rejoinder to the Reply [Rule 69].",
                    "2. Rule 12.5 shall apply."
                  ]
                },
                {
                  "rule_number": "63",
                  "rule_title": "Contents of the Statement for a declaration of non-infringement",
                  "paragraphs": [
                    "The claimant shall, subject to point (b), lodge at the Registry in accordance with Article 33(4),",
                    "Article 7(2) of the Agreement and Annex II thereto, a Statement for a declaration of non-infringement",
                    "which shall contain:",
                    "(a) particulars in accordance with Rule 13.1(a) to (h) and particulars confirming that the requirements",
                    "of Rule 61 are met;",
                    "(b) where the parties have agreed to bring the action before a local division or a regional division in",
                    "accordance with Article 33(7) of the Agreement, an indication of the division which shall hear the action,",
                    "accompanied by evidence of the defendant’s agreement;",
                    "(c) where applicable, an indication that the action shall be heard by a single judge [Article 8(7) of the",
                    "Agreement], accompanied by evidence of the defendant’s agreement;",
                    "(d) the declaration sought by the claimant;",
                    "(e) the reasons why the performance of a specific act does not, or a proposed act would not, constitute",
                    "an infringement of the patent concerned, including arguments of law and where appropriate an",
                    "explanation of the claimant’s proposed claim construction;",
                    "(f) an indication of the facts relied on;",
                    "(g) the evidence relied on, where available, and an indication of any further evidence which will be",
                    "offered in support;",
                    "(h) an indication of any order the claimant will seek at the interim conference [Rule 104(e)];",
                    "(i) where the claimant assesses that the value of the declaratory action exceeds EUR 500.000, an",
                    "indication of the value; and",
                    "(j) a list of the documents, including any witness statements, referred to in the Statement for a",
                    "- 43 -",
                    "declaration together with any request that all or part of any such document need not be translated and/or",
                    "any request pursuant to Rule 262.2 or Rule 262A. Rule 13.2 and .3 shall apply mutatis mutandis."
                  ]
                },
                {
                  "rule_number": "64",
                  "rule_title": "Language of the Statement for a declaration of non-infringement",
                  "paragraphs": [
                    "Rule 45 shall apply mutatis mutandis."
                  ]
                },
                {
                  "rule_number": "65",
                  "rule_title": "Examination as to formal requirements, recording in the register, assignment and",
                  "paragraphs": [
                    "designation of the judge-rapporteur",
                    "Rules 16 to 18 shall apply mutatis mutandis."
                  ]
                },
                {
                  "rule_number": "66",
                  "rule_title": "Preliminary objection",
                  "paragraphs": [
                    "Rule 19.1 to .3 and .5 to .7 as well as Rules 20 and 21 shall apply mutatis mutandis."
                  ]
                },
                {
                  "rule_number": "67",
                  "rule_title": "Lodging of the Defence to the Statement for a declaration of non-infringement",
                  "paragraphs": [
                    "The defendant shall lodge a Defence to the Statement for a declaration of non-infringement within two",
                    "months of service of the Statement for a declaration of non-infringement."
                  ]
                },
                {
                  "rule_number": "68",
                  "rule_title": "Contents of the Defence to the Statement for a declaration of non-infringement",
                  "paragraphs": [
                    "The Defence to the Statement for a declaration of non-infringement shall contain the matters referred to",
                    "in Rule 24(a) to (j). Rule 13.2 and .3 shall apply mutatis mutandis."
                  ]
                },
                {
                  "rule_number": "69",
                  "rule_title": "Reply to Defence to the Statement for a declaration of non-infringement and Rejoinder",
                  "paragraphs": [
                    "to the Reply",
                    "1. The claimant may lodge a Reply to the Defence to the Statement for a declaration of non-infringement",
                    "within one month.",
                    "2. The defendant may lodge a Rejoinder to the Reply within one month of service of the Reply. The",
                    "Rejoinder shall be limited to the matters raised in the Reply."
                  ]
                },
                {
                  "rule_number": "70",
                  "rule_title": "Fee for the action for a declaration of non-infringement",
                  "paragraphs": [
                    "The claimant shall pay the fixed fee and, where applicable, the value based fee for the action for a",
                    "declaration of non-infringement in accordance with Part 6. Rule 15.2 and Rule 16.3 to .5 shall apply",
                    "mutatis mutandis."
                  ]
                },
                {
                  "rule_number": "71",
                  "rule_title": "Examination as to formal requirements and further schedule",
                  "paragraphs": [
                    "Rules 27 and 28 shall apply mutatis mutandis."
                  ]
                },
                {
                  "rule_number": "72",
                  "rule_title": "Request for allocating a technically qualified judge",
                  "paragraphs": [
                    "Rules 33 and 34 shall apply mutatis mutandis."
                  ]
                },
                {
                  "rule_number": "73",
                  "rule_title": "Closure of the written procedure subject to the possible exchange of further pleadings",
                  "paragraphs": [
                    "Rules 35 and 36 shall apply mutatis mutandis.",
                    "- 44 -"
                  ]
                },
                {
                  "rule_number": "74",
                  "rule_title": "Value-based fee for the action for a declaration of non-infringement",
                  "paragraphs": [
                    "1. The value of the action for a declaration of non-infringement shall be determined by the judge-",
                    "rapporteur under Rule 370.6, taking into account the value as assessed by the parties, by way of an order",
                    "during the interim procedure.",
                    "2. Where the value exceeds EUR500.000 the claimant shall pay a value-based fee for the action for a",
                    "declaration of non-infringement in accordance with Part 6. Rule 16.3 to .5 shall apply mutatis mutandis."
                  ]
                }
              ]
            },
            {
              "section_number": "4",
              "section_title": "ACTIONS WITHIN ARTICLE 33(5) AND (6) OF THE AGREEMENT",
              "rules": [
                {
                  "rule_number": "75",
                  "rule_title": "Revocation action and subsequent infringement action in a local or regional division",
                  "paragraphs": [
                    "(Article 33(5) of the Agreement)",
                    "1. Where a claimant has lodged a Statement for revocation [Rule 44] before the central division and the",
                    "defendant or a licensee entitled to commence proceedings pursuant to Article 47 of the Agreement",
                    "subsequently initiates an infringement action in a local or regional division against the claimant in",
                    "respect of the same patent the following procedures shall apply.",
                    "2. The Registry at the local or regional division shall proceed in accordance with Rules 16 and 17. The",
                    "Registry shall as soon as practicable notify the President of the Court of First Instance of the revocation",
                    "action in the central division, the infringement action in the local or regional division and any",
                    "Counterclaim for revocation in the infringement action. The presiding judges of the panels seized shall",
                    "be informed likewise about actions in the other divisions.",
                    "3. Where a Counterclaim for revocation is brought in the infringement action and there is identity of",
                    "parties as between the two actions, unless otherwise agreed by the parties, the panel appointed in the",
                    "central division to hear the revocation action shall stay all further proceedings in the revocation action",
                    "pending a decision of the panel hearing the action for infringement pursuant to Article 33(3) of the",
                    "Agreement and Rule 37.",
                    "4. The panel hearing the action for infringement shall when exercising its discretion under Article 33(3)",
                    "of the Agreement take into consideration how far the revocation action in the central division was",
                    "advanced prior to the stay referred to in paragraph 3.",
                    "5. Where the panel hearing the action for infringement decides to proceed in accordance with",
                    "Article 33(3)(a) of the Agreement, Rules 33 and 34 shall apply mutatis mutandis to the action for",
                    "infringement.",
                    "6. Where the panel hearing the action for infringement decides to proceed in accordance with",
                    "Article 33(3)(b) or (c) of the Agreement, Rules 37.4 and 39 to 41 shall apply mutatis mutandis."
                  ]
                },
                {
                  "rule_number": "76",
                  "rule_title": "Actions for declaration of non-infringement within Article 33(6) of the Agreement",
                  "paragraphs": [
                    "1. Where a claimant has lodged an action for declaration of non-infringement (Rule 61) before the",
                    "central division against the patent proprietor or a licensee entitled to commence infringement",
                    "proceedings pursuant to Article 47 of the Agreement and the defendant proprietor or licensee",
                    "subsequently initiates an action for infringement in a local or regional division against the claimant in",
                    "respect of the same patent and with respect to the same alleged infringement the following procedure",
                    "shall apply.",
                    "- 45 -",
                    "2. The Registry shall proceed in accordance with Rule 16 and 17. The Registry shall as soon as",
                    "practicable notify the President of the Court of First Instance of the co-pending actions and the dates",
                    "attributed to them. The presiding judges of the panels seized shall be informed likewise about the action",
                    "in the other division.",
                    "3. If the date attributed by the Registry to the action for infringement pursuant to Rule 17.1(a) is within",
                    "three months of the date attributed to the action for declaration of non-infringement the panel of the",
                    "central division shall stay all further proceedings in the action for a declaration. If the date attributed to",
                    "the action for infringement is outside the said three month period there shall be no stay but the presiding",
                    "judges of the central division and the local or regional division concerned shall consult to agree on the",
                    "future progress of proceedings including the possibility of a stay of one action pursuant to Rule 295(f)."
                  ]
                },
                {
                  "rule_number": "77",
                  "rule_title": "Action for declaration of non-infringement and action for revocation",
                  "paragraphs": [
                    "An action for declaration of non-infringement may be lodged together with an action for revocation of",
                    "the patent in question. Fees shall be paid in accordance with both Rules 46 and Rules 70 and 74."
                  ]
                }
              ]
            },
            {
              "section_number": "5",
              "section_title": "ACTION FOR COMPENSATION FOR LICENCES ON THE BASIS OF",
              "rules": [
                {
                  "rule_number": "80",
                  "rule_title": "Compensation for a licence of right",
                  "paragraphs": [
                    "1. The Application for appropriate compensation [Article 32(1)(h) of the Agreement] shall contain:",
                    "(a) particulars in accordance with Rule 13.1(a) to (d);",
                    "(b) information on the filing of the statement as referred to in Article 8(1) of Regulation (EU)",
                    "No 1257/2012;",
                    "(c) the licence agreement referred to in Article 8(2) of Regulation (EU) No 1257/2012.",
                    "2. Rules 132, 133, 134, 135 and 137 to 140 apply mutatis mutandis to the procedure for appropriate",
                    "compensation.",
                    "Relation with Agreement: Article 32(1)(h)"
                  ]
                }
              ]
            },
            {
              "section_number": "6",
              "section_title": "ACTION AGAINST DECISIONS OF THE EUROPEAN PATENT OFFICE IN",
              "rules": [
                {
                  "rule_number": "85",
                  "rule_title": "Stages of the proceedings (ex parte proceedings)",
                  "paragraphs": [
                    "1. Subject to paragraph 2, where an action is brought against a decision of the European Patent Office",
                    "in carrying out the tasks referred to in Article 9 of Regulation (EU) No 1257/2012 (hereinafter \"decision",
                    "of the Office\"), proceedings before the Court of First Instance shall consist of:",
                    "(a) a written procedure, which shall include a possibility for interlocutory review by the European Patent",
                    "Office;",
                    "(b) an interim procedure, which may include an interim conference; and",
                    "- 46 -",
                    "(c) an oral procedure which, at the request of the claimant or at the instance of the Court, may include",
                    "an oral hearing.",
                    "2. This Rule and Rules 88 (save as expressly provided for in Rule 97.2), 89 and 91 to 96 shall not apply",
                    "to an expedited action against a decision of the Office pursuant to Rule 97."
                  ]
                },
                {
                  "rule_number": "86",
                  "rule_title": "Suspensive effect",
                  "paragraphs": [
                    "An action against a decision of the Office shall have suspensive effect."
                  ]
                },
                {
                  "rule_number": "87",
                  "rule_title": "Grounds for annulling or altering a decision of the Office",
                  "paragraphs": [
                    "An action against a decision of the Office may be brought on grounds of:",
                    "(a) infringement of Regulation (EU) No 1257/2012 or of Regulation (EU) No 1260/2012 or of any rule",
                    "of law relating to their application;",
                    "(b) infringement of any of the implementing rules of the European Patent Office for carrying out the",
                    "tasks referred to in Article 9(1) of Regulation (EU) No 1257/2012;",
                    "(c) infringement of an essential procedural requirement;",
                    "(d) misuse of power."
                  ]
                },
                {
                  "rule_number": "88",
                  "rule_title": "Application to annul or alter a decision of the Office",
                  "paragraphs": [
                    "1. The claimant shall lodge an Application at the Registry, in accordance with Article 7(2) of the",
                    "Agreement and Annex II thereto, to annul or alter a decision of the Office in the language in which the",
                    "patent was granted, within two months of service of the decision of the Office.",
                    "2. The Application to annul or alter a decision of the Office shall contain:",
                    "(a) the names of the claimant and, where applicable, of the claimant’s representative;",
                    "(b) where the claimant is not the proprietor of or applicant for the European patent with unitary effect,",
                    "an explanation and evidence that he is adversely affected by the decision of the Office and entitled to",
                    "start proceedings [Article 47(7) of the Agreement];",
                    "(c) postal and electronic addresses for service on the claimant and the names and addresses of the",
                    "persons authorised to accept service;",
                    "(d) a reference to the contested decision of the Office;",
                    "(e) where applicable, information about any prior or pending proceedings relating to the patent",
                    "concerned before the Court, the European Patent Office or any other court or authority;",
                    "(f) an indication whether the action shall be heard by a single judge;",
                    "(g) the order or the remedy sought by the claimant;",
                    "(h) one or more grounds for annulling or altering the contested decision, in accordance with Rule 87;",
                    "(i) the facts, evidence and arguments relied on; and",
                    "(j) a list of the documents, including any witness statements, referred to in the Application",
                    "- 47 -",
                    "together with any request that all or part of any such document need not be translated and/or any request",
                    "pursuant to Rule 262.2 or Rule 262A. Rule 13.2 and 3 shall apply mutatis mutandis.",
                    "3. The claimant shall pay the fee for the action against a decision of the Office, in accordance with",
                    "Part 6. Rule 15.2 shall apply mutatis mutandis.",
                    "4. Rule 8 shall not apply.",
                    "Relation with Agreement: Articles 32(1)(i), 33(9), 47(7), 48(7) and 49(6)"
                  ]
                },
                {
                  "rule_number": "89",
                  "rule_title": "Examination as to formal requirements (ex parte proceedings)",
                  "paragraphs": [
                    "1. The Registry shall, as soon as practicable after an Application to annul or alter a decision of the Office",
                    "has been lodged, examine whether the requirements of Articles 47(7) and 49(6) of the Agreement and",
                    "Rule 88.1, .2(a) to (d) and .3 have been complied with.",
                    "2. If the Registry considers that any of the requirements referred to in paragraph 1 has not been complied",
                    "with, it shall invite the claimant to:",
                    "(a) correct the deficiencies noted, within 14 days from the date of service of such notification; and",
                    "(b) where applicable, pay the fee for the action against a decision of the Office, within said 14 days.",
                    "3. The Registry shall at the same time inform the claimant that if the claimant fails to correct the",
                    "deficiencies or pay the fee within the time stated, a decision by default may be given in accordance with",
                    "Rule 355.",
                    "4. If the claimant fails to correct the deficiencies noted or to pay the fee for the action against a decision",
                    "of the Office, the Registry shall inform the President of the Court of First Instance who may reject the",
                    "action as inadmissible by a decision by default. He may give the claimant an opportunity to be heard",
                    "beforehand."
                  ]
                },
                {
                  "rule_number": "90",
                  "rule_title": "Recording in the register (ex parte proceedings)",
                  "paragraphs": [
                    "If the requirements referred to in Rule 89.1 have been complied with, the Registry shall as soon as",
                    "practicable:",
                    "(a) record the date of receipt of the Application to annul or alter a decision of the Office and attribute an",
                    "action number to the file;",
                    "(b) record the file in the register;",
                    "(c) inform the claimant of the action number of the file and the date of receipt; and",
                    "(d) forward the Application to the European Patent Office, with an indication that the Application is",
                    "admissible."
                  ]
                },
                {
                  "rule_number": "91",
                  "rule_title": "Interlocutory revision by the European Patent Office",
                  "paragraphs": [
                    "1. If the European Patent Office considers that the Application to annul or alter a decision of the Office",
                    "is well founded, it shall within two months of the date of receipt of the Application:",
                    "(a) rectify the contested decision in accordance with the order or remedy sought by the claimant",
                    "[Rule 88.2(g)]; and",
                    "- 48 -",
                    "(b) inform the Court that the decision has been rectified.",
                    "2. Where the Court is informed by the European Patent Office that the contested decision has been",
                    "rectified, it shall inform the claimant that the action is closed. It may order full or partial reimbursement",
                    "of the fee for the action against a decision of the Office, in accordance with Part 6."
                  ]
                },
                {
                  "rule_number": "92",
                  "rule_title": "Assignment to panel or to single judge, designation of judge-rapporteur",
                  "paragraphs": [
                    "Where the action is not closed in accordance with Rule 91.2, the action shall, as soon as practicable after",
                    "the expiry of the period referred to in Rule 91.1, be assigned to a panel of the central division or to a",
                    "single judge if requested by the claimant [Rule 88.2(f)] in accordance with Rule 345.3. Rule 18 shall",
                    "apply."
                  ]
                },
                {
                  "rule_number": "93",
                  "rule_title": "Examination of the Application to annul or alter a decision of the Office",
                  "paragraphs": [
                    "1. In the examination of the Application to annul or alter a decision of the Office, the judge-rapporteur",
                    "may invite the claimant to lodge further written pleadings, within a time period to be specified.",
                    "2. Where appropriate, the judge-rapporteur may, after consulting the claimant, set a date and time for an",
                    "interim conference.",
                    "3. Rule 35 shall apply mutatis mutandis."
                  ]
                },
                {
                  "rule_number": "94",
                  "rule_title": "Invitation to the President of the European Patent Office to comment",
                  "paragraphs": [
                    "The judge-rapporteur may, on his own initiative or on request by the President of the European Patent",
                    "Office, invite the President of the European Patent Office to comment in writing on any question arising",
                    "in the course of proceedings under this Section including any appeal by the claimant pursuant to Rule",
                    "220. The claimant shall be entitled to submit his observations on the President’s comments."
                  ]
                },
                {
                  "rule_number": "95",
                  "rule_title": "Lex specialis for the interim procedure (ex parte procedure)",
                  "paragraphs": [
                    "During the interim procedure, the judge-rapporteur shall invite the claimant to indicate whether he",
                    "wishes that an oral hearing be convened. The judge-rapporteur may convene an oral hearing at his own",
                    "instance."
                  ]
                },
                {
                  "rule_number": "96",
                  "rule_title": "Lex specialis for the oral procedure (ex parte procedure)",
                  "paragraphs": [
                    "1. Rules 110.3, 111, 115 and 118.6 shall apply to the oral hearing and to the decision of the Court.",
                    "2. If an oral hearing is not convened, the panel shall decide in accordance with Rule 117."
                  ]
                },
                {
                  "rule_number": "97",
                  "rule_title": "Application to annul a decision of the Office to reject a request for unitary effect",
                  "paragraphs": [
                    "1. The proprietor of a patent whose request for unitary effect has been rejected by the Office shall lodge",
                    "an Application at the Registry in accordance with Article 7(2) of the Agreement and Annex II thereto,",
                    "to reverse the decision of the Office, in the language in which the patent was granted, within three weeks",
                    "of service of the decision of the European Patent Office.",
                    "2. The Application shall contain particulars in accordance with Rule 88.2(a), (c), (d) and (g) to (j) and",
                    "the proprietor shall pay the fee for the action against the decision of the Office in accordance with Part 6.",
                    "Rule 15.2 and Rule 89 shall apply mutatis mutandis.",
                    "- 49 -",
                    "3. If the requirements referred to in paragraph 2 have been complied with, Rule 90 shall apply mutatis",
                    "mutandis.",
                    "4. The Registry shall as soon as practicable forward the Application to the standing judge who may",
                    "invite the President of the European Patent Office to comment on the Application, but shall in any event",
                    "decide the Application within three weeks of the date of receipt of the Application.",
                    "5. A Statement of appeal by the proprietor of the patent or the President of the European Patent Office",
                    "against the decisions of the standing judge pursuant to paragraph 4 may be lodged within three weeks",
                    "of service of the said decision. The Statement of appeal shall contain the particulars previously lodged",
                    "pursuant to paragraph 2 and also the reasons for setting aside the contested decision. The appellant shall",
                    "pay the fee for the appeal in accordance with Part 6. Rule 15.2 shall apply mutatis mutandis. If the",
                    "requirements of this paragraph 5 have been complied with, the Registry shall record the appeal in",
                    "accordance with Rule 230.1 and shall as soon as practicable assign the appeal to the standing judge of",
                    "the Court of Appeal [Rule 345.5 and 345.8] who may invite the other party to comment on the appeal",
                    "but shall in any event decide the appeal within three weeks of receipt by the Registry of the Statement",
                    "of appeal.",
                    "6. The Registry shall as soon as practicable notify the Office of the decision on the Application or on",
                    "the appeal as the case may be."
                  ]
                },
                {
                  "rule_number": "98",
                  "rule_title": "Costs",
                  "paragraphs": [
                    "The parties shall bear their own costs in any action pursuant to Rule 85 or 97.",
                    "- 50 -"
                  ]
                }
              ]
            }
          ]
        },
        {
          "chapter_number": "2",
          "chapter_title": "INTERIM PROCEDURE",
          "sections": []
        },
        {
          "chapter_number": "3",
          "chapter_title": "ORAL PROCEDURE",
          "sections": []
        },
        {
          "chapter_number": "4",
          "chapter_title": "PROCEDURE FOR THE DETERMINATION OF DAMAGES AND",
          "sections": [
            {
              "section_number": "1",
              "section_title": "APPLICATION FOR THE DETERMINATION OF DAMAGES",
              "rules": [
                {
                  "rule_number": "131",
                  "rule_title": "Contents of the Application for the determination of damages",
                  "paragraphs": [
                    "1. The Application for the determination of damages shall contain:",
                    "(a) particulars in accordance with Rule 13.1(a) to (d);",
                    "(b) the date of the decision on the merits and the action number of the file;",
                    "(c) if required a request for an order to lay open books (Rules 141 to 144) in which case the applicant",
                    "shall provide the matters set out in Rule 141(b) to (e).",
                    "2. After any procedure for the laying open of books is complete, or, if that has not been requested in the",
                    "Application referred to in paragraph 1 the applicant shall indicate:",
                    "(a) the redress (damages, licence fees, profits) and the interest thereon requested by him;",
                    "(b) an indication of the facts relied on, in particular calculations concerning lost profits or profits made",
                    "by the unsuccessful party;",
                    "(c) the evidence relied on;",
                    "(d) a statement as to whether the decision on the merits is the subject of an appeal;",
                    "(e) his assessment of the amount of damages due to him."
                  ]
                },
                {
                  "rule_number": "132",
                  "rule_title": "Fee for the Application for the determination of damages",
                  "paragraphs": [
                    "The applicant shall pay the fixed fee and, where applicable, the value based fee for the determination of",
                    "damages in accordance with Part 6. Rule 15.2 shall apply mutatis mutandis.",
                    "- 58 -"
                  ]
                },
                {
                  "rule_number": "133",
                  "rule_title": "Determination of the value-based fee for the determination of damages",
                  "paragraphs": [
                    "Where the value of the action exceeds EUR500.000 the applicant shall pay a value based fee for the",
                    "determination of damages in accordance with Part 6."
                  ]
                },
                {
                  "rule_number": "134",
                  "rule_title": "Examination as to formal requirements of the Application for the determination of",
                  "paragraphs": [
                    "damages",
                    "1. The Registry shall, as soon as practicable after the lodging of the Application for the determination",
                    "of damages, examine whether the requirements of Rules 126, 131.1 and .2(d) and (e) and 132 have been",
                    "complied with.",
                    "2. If the Application for the determination of damages does not comply with the requirements referred",
                    "to in paragraph 1, the Registry shall invite the applicant to correct the deficiencies noted within a time",
                    "period to be specified.",
                    "3. Rule 16.4 to .5 shall apply mutatis mutandis."
                  ]
                },
                {
                  "rule_number": "135",
                  "rule_title": "Recording in the register (Application for the determination of damages) and service",
                  "paragraphs": [
                    "1. If the requirements referred to in Rule 131.1 and .2(d) and (e) have been complied with, the Registry",
                    "shall as soon as practicable:",
                    "(a) record the date of receipt of the Application for the determination of damages;",
                    "(b) record the Application in the register;",
                    "(c) inform the applicant of the date of receipt;",
                    "(d) inform the panel which has given the decision on the merits on infringement that an Application for",
                    "the determination of damages has been lodged;",
                    "(e) serve the Application upon the unsuccessful party.",
                    "2. The panel which has given the decision on the merits on infringement shall be the panel for the",
                    "determination of damages unless for any reason this is not possible or practical in which case the",
                    "presiding judge of the division concerned shall appoint a fresh panel. Rules 17.2 and 18 shall apply",
                    "mutatis mutandis."
                  ]
                },
                {
                  "rule_number": "136",
                  "rule_title": "Stay of the Application for a determination of damages",
                  "paragraphs": [
                    "The Court may stay the Application for a determination of damages pending any appeal on the merits",
                    "pursuant to Rule 295(h) on a reasoned request by the unsuccessful party. The applicant shall be given",
                    "the opportunity to be heard. If the Court continues the proceedings on the Application, it may order the",
                    "applicant to render a security according to Rule 352."
                  ]
                },
                {
                  "rule_number": "137",
                  "rule_title": "Reply of the unsuccessful party",
                  "paragraphs": [
                    "1. If the unsuccessful party accepts the claim made in the Application for the determination of damages,",
                    "it shall within two months inform the Registry. The judge-rapporteur shall make the order for the",
                    "determination of damages in accordance with the Application for the determination of damages.",
                    "- 59 -",
                    "2. If the unsuccessful party contests the claim made in the Application for the determination of damages,",
                    "it shall within two months of service of the Application for the determination of damages or, where there",
                    "was a procedure for the laying open of books, within two months of service of the indication pursuant",
                    "to Rule 131.2, lodge a Defence to the Application for the determination of damages."
                  ]
                },
                {
                  "rule_number": "138",
                  "rule_title": "Contents of the Defence to the Application for the determination of damages",
                  "paragraphs": [
                    "The Defence to the Application for the determination of damages shall contain:",
                    "(a) the names of the unsuccessful party and of that party’s representative;",
                    "(b) postal and electronic addresses for service on the unsuccessful party and the names and addresses of",
                    "the persons authorised to accept service;",
                    "(c) the action number attributed to the file;",
                    "(d) the reasons why the Application for the award of damages is contested;",
                    "(e) an indication of the facts relied on; and",
                    "(f) the evidence relied on."
                  ]
                },
                {
                  "rule_number": "139",
                  "rule_title": "Reply to the Defence to the Application for the determination of damages and",
                  "paragraphs": [
                    "Rejoinder to the Reply",
                    "The applicant may within one month lodge a Reply to the Defence to the Application for the",
                    "determination of damages, limited to the matters raised in the Defence. The unsuccessful party may",
                    "lodge a Rejoinder to the Reply within one month of service of the Reply, limited to the matters raised",
                    "in the Reply."
                  ]
                },
                {
                  "rule_number": "140",
                  "rule_title": "Further procedure (Application for the determination of damages)",
                  "paragraphs": [
                    "1. The judge-rapporteur may order further exchange of written pleadings, within time periods to be",
                    "specified.",
                    "2. The provisions of Part 1, Chapters 2 (Interim procedure) and 3 (Oral procedure) shall apply mutatis",
                    "mutandis but with such reduced timetable as the judge-rapporteur may order. He shall decide on the",
                    "obligation to bear the legal costs of the proceedings for the determination of damages in accordance with",
                    "Article 69 of the Agreement."
                  ]
                }
              ]
            },
            {
              "section_number": "2",
              "section_title": "REQUEST TO LAY OPEN BOOKS",
              "rules": [
                {
                  "rule_number": "141",
                  "rule_title": "Contents of the Request to lay open books",
                  "paragraphs": [
                    "If the applicant has made a request pursuant to Rule 131.1(c), Rules 134 to 136 shall apply mutatis",
                    "mutandis. The Request shall contain:",
                    "(a) particulars in accordance with Rule 131.1(a) and (b);",
                    "(b) details of any information ordered by the Court and given by the other party pursuant to Rule 191;",
                    "(c) a description of the information held by the unsuccessful party to which the applicant requests access,",
                    "in particular documents relating to turnover and profits generated by the infringing products or regarding",
                    "- 60 -",
                    "the extent of use of the infringing process as well as accounts and bank documents, and any related",
                    "document concerning the infringement;",
                    "(d) the reasons why the applicant needs access to this information;",
                    "(e) the facts relied on; and",
                    "(f) the evidence offered in support."
                  ]
                },
                {
                  "rule_number": "142",
                  "rule_title": "Defence of the unsuccessful party, Reply to the Defence and Rejoinder to the Reply",
                  "paragraphs": [
                    "1. If the unsuccessful party accepts the Request to lay open books, it shall within two months of service",
                    "of the Request to lay open books inform the Registry. The judge-rapporteur shall make the order to lay",
                    "open books in accordance with the Request to lay open books.",
                    "2. If the unsuccessful party contests the Request to lay open books, it shall within two months of service",
                    "of the Request to lay open books lodge a Defence to the Request to lay open books.",
                    "3. The applicant may within 14 days of service of the Defence to the Request lodge a Reply to the",
                    "Defence to the Request to lay open books, limited to the matters raised in the Defence. The unsuccessful",
                    "party may within 14 days of service of the Reply lodge a Rejoinder, limited to the matters raised in the",
                    "Reply."
                  ]
                },
                {
                  "rule_number": "143",
                  "rule_title": "Further procedure",
                  "paragraphs": [
                    "Rule 140 shall apply mutatis mutandis."
                  ]
                },
                {
                  "rule_number": "144",
                  "rule_title": "Decision on the Request to lay open books",
                  "paragraphs": [
                    "1. The Court may:",
                    "(a) order the unsuccessful party to open its books to the applicant within a time period to be specified",
                    "and subject to such terms as the Court may deem appropriate having regard inter alia to Article 58 of",
                    "the Agreement and Rule 190.1 and .4;",
                    "(b) inform the applicant and specify a time period within which the procedure for the award of damages",
                    "shall be continued.",
                    "2. Where the Request to lay open books is not allowable, the Court shall inform the applicant and specify",
                    "a time period within which the procedure for the award of damages shall be continued [Rule 131.2].",
                    "- 61 -"
                  ]
                }
              ]
            }
          ]
        },
        {
          "chapter_number": "5",
          "chapter_title": "PROCEDURE FOR COST DECISION",
          "sections": []
        },
        {
          "chapter_number": "6",
          "chapter_title": "SECURITY FOR COSTS",
          "sections": []
        }
      ]
    },
    {
      "part_number": "2",
      "part_title": "EVIDENCE",
      "chapters": [
        {
          "chapter_number": "1",
          "chapter_title": "WITNESSES AND EXPERTS OF THE PARTIES",
          "sections": []
        },
        {
          "chapter_number": "2",
          "chapter_title": "COURT EXPERTS",
          "sections": []
        },
        {
          "chapter_number": "3",
          "chapter_title": "ORDER TO PRODUCE EVIDENCE AND TO COMMUNICATE",
          "sections": []
        },
        {
          "chapter_number": "4",
          "chapter_title": "ORDER TO PRESERVE EVIDENCE (SAISIE) AND ORDER FOR",
          "sections": []
        },
        {
          "chapter_number": "5",
          "chapter_title": "OTHER EVIDENCE",
          "sections": []
        }
      ]
    },
    {
      "part_number": "3",
      "part_title": "PROVISIONAL MEASURES",
      "chapters": []
    },
    {
      "part_number": "4",
      "part_title": "PROCEDURES BEFORE THE COURT OF APPEAL",
      "chapters": [
        {
          "chapter_number": "1",
          "chapter_title": "WRITTEN PROCEDURE",
          "sections": [
            {
              "section_number": "1",
              "section_title": "STATEMENT OF APPEAL, STATEMENT OF GROUNDS OF APPEAL",
              "rules": [
                {
                  "rule_number": "224",
                  "rule_title": "Time periods for lodging the Statement of appeal and the Statement of grounds of",
                  "paragraphs": [
                    "appeal",
                    "1. A Statement of appeal shall be lodged by the appellant:",
                    "(a) within two months of service of a decision referred to in Rule 220.1(a) and (b); or",
                    "(b) within 15 days of service of an order referred to in Rule 220.1(c) or a decision referred to in",
                    "Rule 220.2 or 221.3.",
                    "2. The Statement of grounds of appeal shall be lodged by the appellant:",
                    "(a) within four months of service of a decision referred to in Rule 220.1(a) and (b); or",
                    "(b) within 15 days of service of an order referred to in Rule 220.1(c) or a decision referred to in",
                    "Rule 220.2 or 221.3.",
                    "Relation with Agreement: Article 73(1) and (2)"
                  ]
                },
                {
                  "rule_number": "225",
                  "rule_title": "Contents of the Statement of appeal",
                  "paragraphs": [
                    "The Statement of appeal shall contain:",
                    "(a) the names of the appellant and of the appellant’s representative;",
                    "(b) the names of the respondent and of the respondent’s representative;",
                    "(c) postal and electronic addresses for service on the appellant and on the respondent, as well as the",
                    "names of the persons authorised to accept service;",
                    "(d) the date of the decision or order appealed against and the action number attributed to the file in",
                    "proceedings before the Court of First Instance; and",
                    "(e) the order or remedy sought by the appellant, including any order for expedition of the appeal pursuant",
                    "to Rule 9.3(b) and the reasons justifying such order for expedition."
                  ]
                },
                {
                  "rule_number": "226",
                  "rule_title": "Contents of the Statement of grounds of appeal",
                  "paragraphs": [
                    "The Statement of grounds of appeal shall contain:",
                    "(a) an indication of which parts of the decision or order are contested;",
                    "(b) the reasons for setting aside the contested decision or order; and",
                    "(c) an indication of the facts and evidence on which the appeal is based in accordance with Rule 222.1",
                    "and .2."
                  ]
                },
                {
                  "rule_number": "227",
                  "rule_title": "Language of the Statement of appeal and of the Statement of grounds of appeal",
                  "paragraphs": [
                    "The Statement of appeal and the Statement of grounds of appeal shall be drawn up:",
                    "- 88 -",
                    "(a) without prejudice to Article 50(3) of the Agreement, in the language of the proceedings before the",
                    "Court of First Instance; or",
                    "(b) where the parties have agreed in accordance with Article 50(2) of the Agreement, in the language in",
                    "which the patent was granted. Where the parties have agreed in accordance with Article 50(2) of the",
                    "Agreement, evidence of the respondent’s agreement shall be lodged by the appellant together with the",
                    "Statement of appeal.",
                    "Relationship with Agreement: Article 50"
                  ]
                },
                {
                  "rule_number": "228",
                  "rule_title": "Fee for the appeal",
                  "paragraphs": [
                    "The appellant shall pay the fixed fee and, where applicable, the value based fee for the appeal, in",
                    "accordance with Part 6. Rule 15.2 shall apply mutatis mutandis."
                  ]
                },
                {
                  "rule_number": "229",
                  "rule_title": "Examination as to formal requirements of the Statement of appeal",
                  "paragraphs": [
                    "1. The Registry shall, as soon as practicable after the lodging of the Statement of appeal, examine",
                    "whether the requirements of Rules 224.1, 225, 227 and 228 have been complied with.",
                    "2. If the appellant has not complied with the requirements referred to in Rules 225, 227 or 228, the",
                    "Registry shall invite the appellant to:",
                    "(a) correct the deficiencies within 14 days of service of such notification; and",
                    "(b) where applicable, pay the fee for the appeal within said 14 days.",
                    "3. The Registry shall at the same time inform the appellant that if the appellant fails to correct the",
                    "deficiencies or to pay the fee within the time stated, a decision by default may be given in accordance",
                    "with Rule 357.",
                    "4. If the appellant has not met the requirements of Rules 225, 227 and 228 and fails to correct the",
                    "deficiencies or pay the fee the Registry shall inform the President of the Court of Appeal who shall reject",
                    "the appeal as inadmissible by a decision by default. He may give the appellant an opportunity to be heard",
                    "beforehand.",
                    "5. If the appellant has not met the requirements of Rule 224.1, the Registry shall inform the President of",
                    "the Court of Appeal who shall reject the appeal as inadmissible. He may give the appellant an",
                    "opportunity to be heard beforehand."
                  ]
                },
                {
                  "rule_number": "230",
                  "rule_title": "Recording in the register (Court of Appeal)",
                  "paragraphs": [
                    "1. If the Statement of appeal complies with the requirements referred to in Rule 229.1, the Registry shall:",
                    "(a) record the date of receipt to the Statement of appeal and an action number to the appeal file;",
                    "(b) record the appeal file in the register;",
                    "(c) inform the appellant of the action number and the date of receipt; and",
                    "(d) serve the Statement of appeal on all parties to the proceedings at first instance.",
                    "2. The action shall be assigned to a panel according to Rule 345.3 and .8.",
                    "- 89 -",
                    "3. The panel shall as soon as practicable decide whether to grant any order for expedition pursuant to",
                    "Rule 225(e) having given the parties an opportunity to be heard."
                  ]
                },
                {
                  "rule_number": "231",
                  "rule_title": "Designation of the judge-rapporteur",
                  "paragraphs": [
                    "The presiding judge of the panel to which the action has been assigned shall designate one legally",
                    "qualified judge of the panel as judge-rapporteur. The presiding judge may designate himself as the judge-",
                    "rapporteur. The Registry shall as soon as practicable notify the appellant and respondent of the identity",
                    "of the judge-rapporteur."
                  ]
                },
                {
                  "rule_number": "232",
                  "rule_title": "Translation of file",
                  "paragraphs": [
                    "1. If the language of the proceedings before the Court of Appeal is not the language of the proceedings",
                    "before the Court of First Instance, the judge-rapporteur may order the appellant to lodge, within a time",
                    "period to be specified, translations into the language of the proceedings before the Court of Appeal of:",
                    "(a) written pleadings and other documents lodged by the parties before the Court of First Instance, as",
                    "specified by the judge-rapporteur;",
                    "(b) decisions or orders of the Court of First Instance.",
                    "The judge-rapporteur shall at the same time inform the appellant that if the appellant fails to lodge the",
                    "translations within the time period specified, a decision by default may be given in accordance with",
                    "Rule 357.",
                    "2. If the appellant fails to lodge the translations under paragraph 1 within the time period specified, the",
                    "judge-rapporteur shall reject the appeal by a decision by default in accordance with Rule 357. He may",
                    "give the appellant an opportunity to be heard beforehand.",
                    "3. The appellant may request that documented costs of translations be taken into account when the Court",
                    "fixes the amount of costs in accordance with Part 1, Chapter 5.",
                    "Relation with Agreement: Article 50(2) and (3)"
                  ]
                },
                {
                  "rule_number": "233",
                  "rule_title": "Preliminary examination of the Statement of grounds of appeal",
                  "paragraphs": [
                    "1. The judge-rapporteur shall examine whether the Statement of grounds of appeal satisfies the",
                    "requirements of Rule 226.",
                    "2. If the Statement of grounds of appeal does not comply with the requirements of Rule 226, the judge-",
                    "rapporteur shall give the appellant leave to amend the Statement of grounds of appeal within such period",
                    "as he may decide. If the appellant fails to amend the Statement within such period the judge-rapporteur",
                    "may reject the appeal as inadmissible. He shall give the appellant an opportunity to be heard beforehand.",
                    "3. Grounds of appeal which are not raised within the period specified for the Statement of grounds of",
                    "appeal in Rule 224.2 shall not be admissible."
                  ]
                },
                {
                  "rule_number": "234",
                  "rule_title": "Challenge to the decision to reject an appeal as inadmissible",
                  "paragraphs": [
                    "1. The appellant may challenge a decision to reject the appeal as inadmissible under Rules 224.1 or",
                    "233.2 within one month of service of the decision, without providing new grounds of appeal.",
                    "2. The action shall be assigned to a panel according to Rule 345.3 and .8.",
                    "- 90 -",
                    "3. If a decision to reject an appeal as inadmissible is set aside, the appeal shall take its normal course."
                  ]
                }
              ]
            },
            {
              "section_number": "2",
              "section_title": "STATEMENT OF RESPONSE",
              "rules": [
                {
                  "rule_number": "235",
                  "rule_title": "Statement of response",
                  "paragraphs": [
                    "1. Within three months of service of the Statement of grounds of appeal pursuant to Rule 224.2(a), any",
                    "other party to proceedings before the Court of First Instance (hereinafter \"respondent\") may lodge a",
                    "Statement of response, which shall be served on the appellant.",
                    "2. Within 15 days of service of grounds of appeal pursuant to Rule 224.2(b), any other party to",
                    "proceedings before the Court of First Instance (hereinafter \"respondent\") may lodge a Statement of",
                    "response, which shall be served on the appellant.",
                    "3. If the respondent fails to lodge a Statement of response, the Court of Appeal may give a reasoned",
                    "decision."
                  ]
                },
                {
                  "rule_number": "236",
                  "rule_title": "Contents of the Statement of response",
                  "paragraphs": [
                    "1. The Statement of response shall contain:",
                    "(a) the names of the respondent and the respondent’s representative;",
                    "(b) postal and electronic addresses for service on the respondent and the names and addresses of the",
                    "persons authorised to accept service;",
                    "(c) the action number of the appeal file; and",
                    "(d) a response to the grounds of appeal.",
                    "2. The respondent may support the decision of the Court of First Instance on grounds other than those",
                    "given in the decision."
                  ]
                },
                {
                  "rule_number": "237",
                  "rule_title": "Statement of cross-appeal",
                  "paragraphs": [
                    "1. A party who has not lodged a Statement of appeal within the period referred to in Rule 224.1 may",
                    "still bring an appeal by way of cross-appeal within the period referred to in Rule 235 if one of the other",
                    "parties has lodged a Statement of appeal.",
                    "2. A Statement of cross-appeal shall be included in the Statement of response. It shall comply with the",
                    "requirements of Rules 225 and 226. Rules 229, 233 and 234 shall apply mutatis mutandis to the",
                    "Statement of cross-appeal.",
                    "3. A Statement of cross-appeal shall not be admissible in any other way or at any other time.",
                    "4. A cross-appeal shall be treated as an appeal as far as the fee for the appeal is concerned. Rule 228",
                    "shall apply mutatis mutandis.",
                    "5. If the Statement of appeal is withdrawn, any Statement of cross-appeal shall be deemed to be",
                    "withdrawn.",
                    "- 91 -"
                  ]
                }
              ]
            },
            {
              "section_number": "3",
              "section_title": "REPLY TO A STATEMENT OF CROSS-APPEAL",
              "rules": [
                {
                  "rule_number": "238",
                  "rule_title": "Reply to a Statement of cross-appeal and further schedule",
                  "paragraphs": [
                    "1. The appellant may, within two months of service of any Statement of cross-appeal under Rules 237,",
                    "235.1, lodge a Reply to the Statement of cross-appeal which shall contain a response to the grounds of",
                    "appeal raised in the Statement of cross-appeal.",
                    "2. The appellant may, within 15 days of service of the Statement of cross-appeal under Rules 237 and",
                    "235.2, lodge a Reply to the Statement of cross-appeal which shall contain a response to the grounds of",
                    "appeal raised in the Statement of cross-appeal.",
                    "3. Rule 28 shall apply mutatis mutandis."
                  ]
                }
              ]
            },
            {
              "section_number": "4",
              "section_title": "REFERRAL TO THE FULL COURT",
              "rules": [
                {
                  "rule_number": "238A",
                  "rule_title": "Decision to refer",
                  "paragraphs": [
                    "1. The panel to which the action has been assigned may refer it to the full Court of Appeal if the panel",
                    "considers, on a proposal from the presiding judge, the case to be of exceptional importance and, in",
                    "particular, where the decision in the action may affect the consistency and unity of the case law of the",
                    "Court.",
                    "2. The presiding judge of the panel shall request the President of the Court of Appeal and the two judges",
                    "of the Court of Appeal who are members of the Presidium to appoint the judges of the Court of Appeal",
                    "to the full Court. The appointees shall be the President of the Court of Appeal and not less than ten",
                    "(legally and technically qualified) judges of the Court of Appeal to represent the initial two panels of",
                    "the Court of Appeal. In the event that the Court of Appeal shall have more than two panels the appointees",
                    "to the full Court shall increase by five judges, (legally and technically qualified), for each additional",
                    "panel.",
                    "3. Decisions of the full Court shall be by no less than a three-quarters majority of the judges of the full",
                    "Court.",
                    "- 92 -"
                  ]
                }
              ]
            }
          ]
        },
        {
          "chapter_number": "2",
          "chapter_title": "INTERIM PROCEDURE",
          "sections": []
        },
        {
          "chapter_number": "3",
          "chapter_title": "ORAL PROCEDURE",
          "sections": []
        },
        {
          "chapter_number": "4",
          "chapter_title": "DECISIONS AND EFFECT OF DECISIONS",
          "sections": []
        },
        {
          "chapter_number": "5",
          "chapter_title": "PROCEDURE FOR APPLICATION FOR REHEARING",
          "sections": []
        }
      ]
    },
    {
      "part_number": "5",
      "part_title": "GENERAL PROVISIONS",
      "chapters": [
        {
          "chapter_number": "1",
          "chapter_title": "GENERAL PROCEDURAL PROVISIONS",
          "sections": []
        },
        {
          "chapter_number": "2",
          "chapter_title": "SERVICE",
          "sections": [
            {
              "section_number": "1",
              "section_title": "SERVICE WITHIN THE CONTRACTING MEMBER STATES",
              "rules": [
                {
                  "rule_number": "270",
                  "rule_title": "Scope of this Section",
                  "paragraphs": [
                    "1. For service of the Statement of claim within the Contracting Member States the law of the European",
                    "Union on the service of documents in civil and commercial matters [Regulation (EU) 2020/1784] and",
                    "the rules set out in this Section, in particular Rule 271.2 shall apply.",
                    "2. For the purpose of Rules 270 to 275 the term Statement of claim shall, where appropriate, mean all",
                    "originating pleadings in actions referred to in Article 32(1) of the Agreement."
                  ]
                },
                {
                  "rule_number": "271",
                  "rule_title": "Service of the Statement of claim",
                  "paragraphs": [
                    "1. The Registry shall serve the Statement of claim by electronic means if the conditions referred to in",
                    "Article 19 of the Regulation (EU) 2020/1784 are met",
                    "(a) on the defendant at an electronic address which the defendant has provided for the purpose of service",
                    "in the proceedings; or",
                    "(b) on a representative of the defendant if the defendant has provided the electronic address of a",
                    "representative pursuant to Rule 8.1 as an address at which the defendant may be served with the",
                    "Statement of claim; or",
                    "(c) on a representative of the defendant pursuant to Rule 8.1 if the representative has notified the",
                    "Registry or the claimant that he accepts service of the Statement of claim on behalf of the defendant at",
                    "an electronic address.",
                    "2. Where a representative pursuant to Rule 8.1 accepts service on behalf of a party service may be",
                    "effected within the closed electronic system of the UPC Case Management System (CMS).",
                    "3. For the purpose of serving a Statement for revocation [Rule 44] or of serving a Statement for",
                    "declaration of non-infringement [Rule 63], reference to representative under paragraph 2(b) or (c) shall",
                    "additionally include professional representatives and legal practitioners as defined in Article 134 EPC",
                    "who are recorded as the appointed representative for the patent, the subject of the proceedings, in the",
                    "Register for unitary patent protection [Regulation (EU) No 1257/2012, Article 2(e)] or in the national",
                    "patent register [Rule 8.5(a)].",
                    "4. Where service by electronic means cannot be effected, the Registry shall serve the Statement of claim",
                    "on the defendant by:",
                    "(a) any other method foreseen by the law of the European Union on the service of documents in civil",
                    "and commercial matters [Regulation (EU) 2020/1784], in particular by registered letter with",
                    "acknowledgement of receipt or equivalent [Article 18 Regulation (EU) 2020/1784]; or",
                    "(b) where service in accordance with paragraph 4(a) could not be effected any method permitted by the",
                    "law of the Member State of the European Union where service is to be effected or authorised by the",
                    "Court under Rule 275.",
                    "5. Service under this Section shall be effected at the following place:",
                    "- 103 -",
                    "(a) where the defendant is a company or other legal person, at its statutory seat, central administration",
                    "or principal place of business within the Contracting Member States or at any place within the",
                    "Contracting Member States where the company or other legal person has a permanent or temporary",
                    "place of business;",
                    "(b) where the defendant is an individual, at his usual or last known residence within the Contracting",
                    "Member States; or",
                    "(c) for the purpose of serving a Statement for revocation [Rule 44] or of serving a Statement for a",
                    "declaration of non-infringement [Rule 63], at the place of business of a professional representative or",
                    "legal practitioner as defined in Article 134 EPC who is recorded as the appointed representative for the",
                    "patent, the subject of the proceedings, in the Register for unitary patent protection [Regulation (EU)",
                    "No 1257/2012, Article 2(e)] or of the patent office of a Contracting Member State.",
                    "6. Subject to Rule 272.2 and .3, a Statement of claim served in accordance with paragraphs 1 to 5 is",
                    "deemed to be served on the defendant:",
                    "(a) where service takes place by means of electronic communication, on the day when the relevant",
                    "electronic message was sent (GMT+1);",
                    "(b) where service takes place by registered letter with acknowledgement of receipt or equivalent such",
                    "letter shall be deemed to be served on the addressee on the tenth day following posting unless it has",
                    "failed to reach the addressee, has in fact reached him on a later date or the acknowledgement of receipt",
                    "or equivalent has not been returned. Such service shall, except where paragraph 8 applies, be deemed",
                    "effective even if acceptance of the letter has been refused.",
                    "7. The Registry shall advise the defendant that he may refuse to accept a Statement of Claim if it is not",
                    "written or not accompanied by a translation into a language that he understands or that is an official",
                    "language of the place where service is to be effected, by enclosing with the document to be served form",
                    "L in Annex I of Regulation (EU) 2020/1784.",
                    "8. Where the defendant is entitled to refuse service and where he has notified the refusal to the Registry",
                    "within two weeks of the attempted service together with an indication of the language(s) he understands,",
                    "the Registry shall inform the claimant. The claimant shall provide to the Registry translations of at least",
                    "the Statement of claim and the information required in Rule 13.1(a) to (p) in a language provided for by",
                    "paragraph 7."
                  ]
                },
                {
                  "rule_number": "272",
                  "rule_title": "Notice of service and non-service of the Statement of claim",
                  "paragraphs": [
                    "1. The Registry shall inform the claimant of the date on which the Statement of claim is deemed served",
                    "under Rule 271.6.",
                    "2. Where the Registry has served the Statement of claim by registered letter with acknowledgement of",
                    "receipt or equivalent and the Statement of claim is returned to the Registry for any reason, the Registry",
                    "shall inform the claimant.",
                    "3. Paragraph 2 shall apply mutatis mutandis where the Registry has served the Statement of claim by",
                    "means of electronic communication and the relevant electronic message appears not to have been",
                    "received.",
                    "- 104 -"
                  ]
                }
              ]
            },
            {
              "section_number": "2",
              "section_title": "SERVICE OUTSIDE THE CONTRACTING MEMBER STATES",
              "rules": [
                {
                  "rule_number": "273",
                  "rule_title": "Scope of this Section",
                  "paragraphs": [
                    "This Section applies to service of a Statement of claim outside the Contracting Member States."
                  ]
                },
                {
                  "rule_number": "274",
                  "rule_title": "Service outside the Contracting Member States",
                  "paragraphs": [
                    "1. Where a Statement of claim is to be served outside the Contracting Member States, it shall be so",
                    "served by the Registry",
                    "(a) by any method provided by:",
                    "(i) The law of the European Union on the service of documents in civil and commercial matters",
                    "[Regulation (EU) 2020/1784] where it applies;",
                    "(ii) The Hague Service Convention or any other applicable convention or agreement where it applies;",
                    "or",
                    "(iii) to the extent that there is no such convention or agreement in force, either by service through",
                    "diplomatic or consular channels from the Contracting Member State in which the sub-registry of the",
                    "relevant division is established;",
                    "(b) where service in accordance with paragraph 1(a) could not be effected by any method permitted by",
                    "the law of the state where service is to be effected or as authorised by the Court under Rule 275.",
                    "2. No Statement of claim may be served under this Rule 274 in a manner which is contrary to the law of",
                    "the state where service is effected.",
                    "3. The Registry shall inform the claimant of the date on which the Statement of claim is deemed served",
                    "under paragraph 1.",
                    "4. The Registry shall inform the claimant if for any reason service pursuant to paragraph 1 cannot be",
                    "effected."
                  ]
                }
              ]
            },
            {
              "section_number": "3",
              "section_title": "SERVICE BY AN ALTERNATIVE METHOD",
              "rules": [
                {
                  "rule_number": "275",
                  "rule_title": "Service of the Statement of claim by an alternative method or at an alternative place",
                  "paragraphs": [
                    "1. Where service in accordance with Section 1 or 2 could not be effected the Court on an application by",
                    "the claimant that there is a good reason to authorise service by a method or at a place not otherwise",
                    "permitted by this Chapter, the Court may by way of order permit service by an alternative method or at",
                    "an alternative place.",
                    "2. On a reasoned request by the claimant, the Court may order that steps already taken to bring the",
                    "Statement of claim to the attention of the defendant by an alternative method or at an alternative place",
                    "is good service.",
                    "3. An order under this rule shall specify:",
                    "(a) the method or place of service;",
                    "(b) the date on which the Statement of claim is deemed served; and",
                    "- 105 -",
                    "(c) the period for filing the Statement of defence.",
                    "4. No order for alternative service under this Rule shall be made permitting service in a manner that is",
                    "contrary to the law of the state where service is to be effected."
                  ]
                }
              ]
            },
            {
              "section_number": "4",
              "section_title": "SERVICE OF ORDERS, DECISIONS AND WRITTEN PLEADINGS",
              "rules": [
                {
                  "rule_number": "276",
                  "rule_title": "Service of orders and decisions",
                  "paragraphs": [
                    "1. Any order or decision of the Court shall be served on each of the parties in accordance with the",
                    "provisions of Sections 1, 2 or 3 of this Chapter 2, as the case may be.",
                    "2. Decisions by default pursuant to Rule 355 resulting from failure of the defendant to lodge a Defence",
                    "to revocation [Rule 50] or failure to lodge a Defence to the Statement for a declaration of non-",
                    "infringement [Rule 67] within the time limit set by these Rules or by the Court, may be served on the",
                    "defendant at the place of business of a professional representative or legal practitioner as defined in",
                    "Article 134 EPC who is recorded as the appointed representative for the subject European patent with",
                    "unitary effect, the subject of the proceedings, in the Register for unitary patent protection [Regulation",
                    "(EU) No 1257/2012, Article 2(e)] or in the national patent register [Rule 8.5(a)]."
                  ]
                },
                {
                  "rule_number": "277",
                  "rule_title": "Decisions by default under Part 5, Chapter 11",
                  "paragraphs": [
                    "No decision by default shall be entered under Part 5, Chapter 11 unless the Court is satisfied that either:",
                    "(a) the Statement of claim was served by a method prescribed by the internal law of the state addressed",
                    "for the service of documents in domestic actions upon persons who are within its territory; or",
                    "(b) the Statement of claim was actually served on the defendant under this Chapter 2."
                  ]
                },
                {
                  "rule_number": "278",
                  "rule_title": "Service of written pleadings and other documents",
                  "paragraphs": [
                    "1. As soon as practicable after written pleadings have been received at the Registry, the Registry shall",
                    "serve the pleadings and any other document lodged with the pleadings on the other party by means of",
                    "electronic communication except if the pleading contains a request for an ex parte proceeding.",
                    "2. Where service by means of electronic communication cannot be effected, the Registry shall serve the",
                    "written pleadings on the party by:",
                    "(a) registered letter with acknowledgement of receipt or equivalent; or",
                    "(b) any method authorised by the Court under Rule 275.",
                    "3. Service under paragraph 2(a) shall be effected at the following place:",
                    "(a) where the party is a company or other legal person: at its statutory seat, central administration,",
                    "principal place of business or at any place within the Contracting Member States where the company or",
                    "other legal person has a place of business;",
                    "(b) where the party is an individual: at his usual or last known residence within the Contracting Member",
                    "States.",
                    "4. Rule 271.6 and 272 shall apply mutatis mutandis.",
                    "- 106 -",
                    "5. Where a party is represented pursuant to Rule 8.1, the pleadings and other documents referred to in",
                    "paragraph 1 shall be served on that representative. Paragraph 2 shall apply mutatis mutandis."
                  ]
                },
                {
                  "rule_number": "279",
                  "rule_title": "Change of electronic address for service",
                  "paragraphs": [
                    "Where the electronic address for service of a party changes, that party must give notice in writing of the",
                    "change as soon as it has taken place to the Registry and every other party [Rule 6.3].",
                    "- 107 -"
                  ]
                }
              ]
            }
          ]
        },
        {
          "chapter_number": "3",
          "chapter_title": "RIGHTS AND OBLIGATIONS OF REPRESENTATIVES",
          "sections": []
        },
        {
          "chapter_number": "4",
          "chapter_title": "STAY OF PROCEEDINGS",
          "sections": []
        },
        {
          "chapter_number": "5",
          "chapter_title": "TIME PERIODS",
          "sections": []
        },
        {
          "chapter_number": "6",
          "chapter_title": "PARTIES TO PROCEEDINGS",
          "sections": [
            {
              "section_number": "1",
              "section_title": "PLURALITY OF PARTIES",
              "rules": [
                {
                  "rule_number": "302",
                  "rule_title": "Plurality of claimants or patents",
                  "paragraphs": [
                    "1. The Court may order that proceedings commenced by a plurality of claimants or in respect of a",
                    "plurality of patents be heard in separate proceedings.",
                    "2. Where the Court orders a separation of proceedings the Court shall decide on the payment of a new",
                    "court fee or court fees in accordance with Part 6.",
                    "3. The Court may order that parallel infringement or revocation proceedings relating to the same patent",
                    "or patents and before the same local or regional division or the central division or the Court of Appeal",
                    "be heard together where it is in the interests of justice to do so."
                  ]
                },
                {
                  "rule_number": "303",
                  "rule_title": "Plurality of defendants",
                  "paragraphs": [
                    "1. Proceedings may be started against a plurality of defendants if the Court has competence in respect",
                    "of all of them.",
                    "2. The Court may separate the proceedings into two or more separate proceedings against different",
                    "defendants.",
                    "3. Where the Court orders a separation of proceedings under paragraph 2, the claimants in the new",
                    "proceedings shall pay a new court fee in accordance with Part 6, unless the Court decides otherwise."
                  ]
                }
              ]
            },
            {
              "section_number": "2",
              "section_title": "CHANGE IN PARTIES",
              "rules": [
                {
                  "rule_number": "305",
                  "rule_title": "Change in parties",
                  "paragraphs": [
                    "1. The Court may, on application by a party, order a person to:",
                    "(a) be added as a party;",
                    "(b) cease to be a party;",
                    "(c) be substituted for a party.",
                    "2. The Court shall invite other parties to the proceedings to comment on the application, as soon as",
                    "practicable after service of the application.",
                    "3. When ordering that a person shall become a party or shall cease to be a party, the Court may make",
                    "appropriate orders as to payment of court fees and costs as regards such party."
                  ]
                },
                {
                  "rule_number": "306",
                  "rule_title": "Consequences for the proceedings",
                  "paragraphs": [
                    "1. Where the Court orders that a party be added, removed or substituted under Rule 305.1, it shall give",
                    "directions to regulate the consequences as to case management.",
                    "2. The Court shall also determine the extent to which a new party is bound by the proceedings as then",
                    "constituted.",
                    "- 114 -"
                  ]
                }
              ]
            },
            {
              "section_number": "3",
              "section_title": "DEATH, DEMISE OR INSOLVENCY OF A PARTY",
              "rules": [
                {
                  "rule_number": "310",
                  "rule_title": "Death or demise of a party",
                  "paragraphs": [
                    "1. If a party dies or ceases to exist during proceedings, the proceedings shall be stayed until such party",
                    "is replaced by his successor. The Court may specify a period in this respect.",
                    "2. If there are more than two parties to the proceedings, the Court may decide that:",
                    "(a) proceedings between the remaining parties be continued separately; and",
                    "(b) the stay shall only concern the proceedings regarding the party that no longer exists.",
                    "3. If the successor of the party that died or ceased to exist does not continue the proceedings of his own",
                    "motion, within a period specified by the Court, any other party may apply to have the successor added",
                    "to or substituted for a party.",
                    "4. The Court shall decide who shall be added or substituted as a party pursuant to Rule 305 and 306 shall",
                    "apply mutatis mutandis."
                  ]
                },
                {
                  "rule_number": "311",
                  "rule_title": "Insolvency of a party",
                  "paragraphs": [
                    "1. If a party is declared insolvent under the law applicable to the insolvency proceedings the Court shall",
                    "stay the proceedings up to three months. They may be stayed until the competent national authority or",
                    "person dealing with the insolvency has decided whether to continue the proceedings or not. Where the",
                    "competent national authority or person dealing with the insolvency decides not to continue the",
                    "proceedings, the Court may decide, upon a reasoned request by the other party, that the proceedings",
                    "should be continued in accordance with the applicable national insolvency law.",
                    "2. Proceedings may also be stayed at the request of a temporary administrator who has been appointed",
                    "before a party is declared insolvent.",
                    "3. The claimant may withdraw the action against an insolvent defendant in accordance with Rule 265",
                    "and a defendant may withdraw a Counterclaim against an insolvent claimant. Such withdrawal shall not",
                    "prejudice the action against other parties.",
                    "4. If proceedings are continued, the effect of a decision of the Court as regards the insolvent party in the",
                    "action shall be determined by the law applicable to the insolvency proceedings."
                  ]
                }
              ]
            },
            {
              "section_number": "4",
              "section_title": "TRANSFER OF PATENT",
              "rules": [
                {
                  "rule_number": "312",
                  "rule_title": "Transfer of the patent or patent application during proceedings",
                  "paragraphs": [
                    "1. If a patent or patent application is transferred, for one or more Contracting Member States, to another",
                    "proprietor after proceedings have been started before the Court, the Court may authorise the new",
                    "proprietor to be added as a party or substituted for a party pursuant to Rule 305 to the extent that the",
                    "patent and the claims in the proceedings have been assigned to the new proprietor. Rule 306 shall apply",
                    "mutatis mutandis.",
                    "2. If the new proprietor takes over the proceedings, no new court fee shall be payable, even if the new",
                    "proprietor is represented by a new representative.",
                    "- 115 -",
                    "3. If the new proprietor chooses not to take over the proceedings, any decision in proceedings that have",
                    "been recorded in the register shall be binding upon him."
                  ]
                }
              ]
            },
            {
              "section_number": "5",
              "section_title": "INTERVENTION",
              "rules": [
                {
                  "rule_number": "313",
                  "rule_title": "Application to intervene",
                  "paragraphs": [
                    "1. An Application to intervene may be lodged at any stage of the proceedings before the Court of First",
                    "Instance or the Court of Appeal by any person establishing a legal interest in the result of an action",
                    "submitted to the Court (hereinafter “the intervener”).",
                    "2. An Application to intervene shall be admissible only if it is made in support, in whole or in part, of a",
                    "claim, order or remedy sought by one of the parties and is made before the closure of the written",
                    "procedure unless the Court of First Instance or Court of Appeal orders otherwise.",
                    "3. The intervener shall be represented in accordance with Article 48 of the Agreement.",
                    "4. The Application to intervene shall contain:",
                    "(a) a reference to the action number of the file;",
                    "(b) the names of the intervener and of the intervener’s representative, as well as postal and electronic",
                    "addresses for service and the names of the persons authorised to accept service;",
                    "(c) the claim, order or remedy in support of which intervention is sought by the intervener; and",
                    "(d) a statement of the facts establishing the right to intervene under paragraphs 1 and 2."
                  ]
                },
                {
                  "rule_number": "314",
                  "rule_title": "Order on Application to intervene",
                  "paragraphs": [
                    "The judge-rapporteur shall decide on the admissibility of the Application to intervene by way of order.",
                    "The other parties shall be given an opportunity to be heard beforehand."
                  ]
                },
                {
                  "rule_number": "315",
                  "rule_title": "Statement in intervention",
                  "paragraphs": [
                    "1. If an Application to intervene is admissible, the judge-rapporteur or the presiding judge shall:",
                    "(a) inform the parties to proceedings; and",
                    "(b) specify a period within which the intervener may lodge a Statement in intervention.",
                    "2. The Registry shall as soon as practicable serve on the intervener any written pleading served by the",
                    "parties. On a reasoned request by a party the Court may for the protection of confidential information",
                    "order that a pleading or part of a pleading be disclosed only to certain named persons and subject to",
                    "appropriate terms of non-disclosure.",
                    "3. The Statement in intervention shall contain:",
                    "(a) a statement as to the issues involving the intervener and one or more of the parties, and their",
                    "connection to the matters in dispute;",
                    "(b) the arguments of law; and",
                    "(c) the facts and evidence relied on.",
                    "- 116 -",
                    "4. The intervener shall be treated as a party, unless otherwise ordered by the Court."
                  ]
                },
                {
                  "rule_number": "316",
                  "rule_title": "Invitation to intervene",
                  "paragraphs": [
                    "1. The judge-rapporteur or the presiding judge may, of his own motion after hearing the parties, or on a",
                    "reasoned request from a party, invite any person concerned by the outcome of the dispute to inform the",
                    "Court, within a period to be specified, whether he wishes to intervene in the proceedings.",
                    "2. If the person wishes to intervene, he shall present his Application to intervene within one month of",
                    "service of the invitation and his Statement in intervention within such further period to be specified by",
                    "the judge-rapporteur or the presiding judge. Rules 313.3, .4, 314 and 315 shall apply mutatis mutandis.",
                    "3. An intervener shall be bound by the decision in the action."
                  ]
                },
                {
                  "rule_number": "316A",
                  "rule_title": "Forced intervention",
                  "paragraphs": [
                    "1. A party who contends that the person should be bound by the decision in the action even if he refuses",
                    "to intervene shall give reasons for this contention in its reasoned request. In such a case the invitation",
                    "must include these reasons and must state that the party making the request contends that the person",
                    "should be bound by the decision in the action even if that person refuses to intervene.",
                    "2. If the person invited to intervene pursuant to Rule 316.1 does not intervene but wishes to contend that",
                    "he should not be bound by the decision in the action, he shall lodge a statement to that effect within the",
                    "one month period referred to in Rule 316.2. If no such statement is lodged within the time specified he",
                    "shall be bound by the decision in the action as between himself and any other party to the action and",
                    "shall not be entitled to argue that the decision in the action was wrong or that the inviting party did not",
                    "conduct the proceedings leading to the decision in the action properly. If a statement is lodged within",
                    "the time specified then the Court shall decide whether the person invited to intervene shall be bound",
                    "having heard the parties and the person invited to intervene. If the Court so decides, the person invited",
                    "to intervene may present an Application to intervene within one month of service of the Court’s decision.",
                    "Rule 316.2 shall apply. If the person invited to intervene fails to present such an application, he shall be",
                    "bound by the decision in the action."
                  ]
                },
                {
                  "rule_number": "317",
                  "rule_title": "No appeal against an order on the Application to intervene",
                  "paragraphs": [
                    "There shall be no appeal against an order refusing an Application to intervene."
                  ]
                }
              ]
            },
            {
              "section_number": "6",
              "section_title": "RE-ESTABLISHMENT OF RIGHTS",
              "rules": [
                {
                  "rule_number": "320",
                  "rule_title": "Re-establishment of rights",
                  "paragraphs": [
                    "1. Where a party has failed to observe a time-limit set by these Rules or the Court for a cause which,",
                    "despite all due care having been taken by the party, was outside his control and the non-observance of",
                    "this time limit has had the direct consequence of causing the party to lose a right or means of redress,",
                    "the relevant panel of the Court may upon the request of that party re-establish the right or means of",
                    "redress.",
                    "2. The Application for Re-establishment of rights shall be lodged with the Registry within one month of",
                    "the removal of the cause for non-observance of the time-limit but in any event within six months of the",
                    "non-observed time-limit. Within that time-limit a fee shall be paid for a Request for Re-establishment",
                    "of rights, in accordance with Part 6.",
                    "- 117 -",
                    "3. The Application shall:",
                    "(a) state the grounds on which it is based and shall set out the facts on which it relies; and",
                    "(b) contain the evidence relied on in the form of affidavits from all persons involved in the non-",
                    "observance of the time-limit and the persons involved in establishing the precautionary measures of due",
                    "care taken in order to avoid such cases of non-compliance.",
                    "4. The omitted act shall be performed or completed together with Application for Re-establishment",
                    "within the time-limit mentioned in paragraph 2.",
                    "5. There shall be no grant of Re-establishment of rights in respect of the non-observance of the time",
                    "limit mentioned in paragraphs 2 and 4 of this Rule.",
                    "6. The panel shall decide on the Application for Re-establishment of rights by way of order. The other",
                    "parties shall be given an opportunity to be heard beforehand.",
                    "7. There shall be no right to appeal from an order rejecting an Application for Re-establishment of rights",
                    "or from an order granting Re-establishment of rights.",
                    "- 118 -"
                  ]
                }
              ]
            }
          ]
        },
        {
          "chapter_number": "7",
          "chapter_title": "MISCELLANEOUS PROVISIONS ON LANGUAGES",
          "sections": []
        },
        {
          "chapter_number": "8",
          "chapter_title": "CASE MANAGEMENT",
          "sections": []
        },
        {
          "chapter_number": "9",
          "chapter_title": "RULES RELATING TO THE ORGANISATION OF THE COURT",
          "sections": []
        },
        {
          "chapter_number": "10",
          "chapter_title": "DECISIONS AND ORDERS",
          "sections": []
        },
        {
          "chapter_number": "11",
          "chapter_title": "DECISION BY DEFAULT",
          "sections": []
        },
        {
          "chapter_number": "12",
          "chapter_title": "ACTIONS BOUND TO FAIL OR MANIFESTLY INADMISSIBLE",
          "sections": []
        },
        {
          "chapter_number": "13",
          "chapter_title": "SETTLEMENT",
          "sections": []
        }
      ]
    },
    {
      "part_number": "6",
      "part_title": "FEES AND LEGAL AID",
      "chapters": []
    }
  ]
}